[
    {
        "name": "Anaily  Acosta",
        "school": "Hire",
        "paradigm": "8 rounds\n\n\n\nNone\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Shakun  Agarwal",
        "school": "Leland High School",
        "paradigm": "Last changed on\nSun January 24, 2021  at 7:46 AM PDT\n\n\nI am a parent judge with 3 years of novice, JV and Varsity PF experience. I have also judged a few LD and Policy debates. Please consider me a Flay Judge.\n\nSpeak as fast as you would like, but I will ask you to slow down if I cannot understand. No spreading please. I am fine with 15 seconds of grace time.\nPlease be respectful of your opponents and give them a chance to speak. Do not keep interrupting or be rude or condescending. If not, I will drop your speaker points.\nPlease do not read any form of progressive argumentation (theory, kritiks, etc.) as I cannot evaluate them and will not give you credit for them.\nOff-time roadmaps and sign-posting are encouraged. It helps me follow your debate better.\nMy decision will be based on your contentions, evidence, rebuttals, impacts, summaries and weighing. I will evaluate all those on both sides to come to a decision.\nI like to see well-researched cases backed by strong and credible evidence. Please include me in the email chain to share cards as I like to review them as well.\n\nGood luck and have fun!\n\n",
        "rating": "Lay"
    },
    {
        "name": "Destiny  Al-Jararheh",
        "school": "Hire",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Vimal  Arora",
        "school": "Del Norte Independent",
        "paradigm": "Last changed on\nSun September 12, 2021  at 11:19 AM PDT\n\n\nDebaters:\n- Be confident (I may not understand everything you're saying so I'll assume that the more confident speakers are right)\n- Convince me why you're right and why you are winning\n- Be respectful of your opponents\n- Be clear and concise with what you're saying - don't read me some random piece of evidence; I want an explanation about it, what it has to do with what you're saying, and where you got it from\n- Be clear when you're speaking; You can speak at any pace but it needs to be comprehensible\n\n",
        "rating": "Lay"
    },
    {
        "name": "Shelly  Bajaj",
        "school": "The Quarry Lane School",
        "paradigm": "Last changed on\nMon October 12, 2020  at 1:31 PM PDT\n\n\nParent judge with no prior experience.\nPlease be respectful and speak clearly.\nTry to avoid using debate jargon and make sure to explain your arguments thoroughly, as anything that goes unexplained may not be taken into consideration.\n\n",
        "rating": "Lay"
    },
    {
        "name": "Nicholas  Balfe",
        "school": "Loyola High School",
        "paradigm": "Last changed on\nTue January 19, 2021  at 1:58 AM PDT\n\n\nI competed in Public Forum debate for a number of years at Loyola High School. Personally, I view debate as a game, in which I look at arguments in an offensive/defensive structure. It is up to the debaters to define the rules of the game through framework, observations, etc. However, I also focus highly on real-world and logical impacts for arguments and certainly weigh the policy implications of any contention brought up in round.\nIn terms of speaker points, I focus on the overall flow of a speech as well as the eye contact, posture, etc. I am fine with speed so long as I can clearly understand what is being said.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Tristan  Bato",
        "school": "College Prep",
        "paradigm": "Last changed on\nMon September 13, 2021  at 1:50 PM EDT\n\n\nDamien '20 ---&gt; UC Davis '24\nhe/him\nEmail Chain: tjbdebate@gmail.com\nONLINE DEBATE UPDATE: After judging a good amount of online debates, the biggest issue I have is hearing analytics so I would definitely slow down because I want to get down as much of what you're saying. Also if you have a microphone, I suggest using that because it helps a ton.\nQualifications: I debated four years at Damien. I had some bids, did the online TOC thing, and did kinda well at some national tournaments. I know some stuff about debate and I think I can make a good decision most of the time. By no means am I perfect, but I do my best to understand a multitude of arguments and judge well.\nHere are some people whose thoughts have greatly influenced my personal philosophy: Christina Phillips, Mike Shackelford, Jon Sharp, Chris Paredes, Michael Wimsatt, Cade Cottrell, Christian Bato, Kelly Ye\nTop Level: I believe that debate is a unique environment where education and competitive prowess intersect. At the end of the day, debate is a competition, but there are obviously important educational benefits in this activity that are intrinsic to the discussion that takes place. I believe that line by line is amazing and cloud clash is rather disappointing. I do not and will never claim to have the best flow, but I do my best to catch every argument. I prioritize tech over truth within reason. Obviously there are some arguments that are just non-starters (i.e. racism good or sexism good etc.), so please don't even try it because you'll just piss me off. Just do you and I will try to adjudicate as objectively as possible.\nHere are some specific thoughts I have about some arguments so do with this what you will.\nDisadvantages: I love disads. My favorite 2NR in my senior year was the Deterrence DA. 2NRs that create a strong story about the DA and set thresholds for risk analysis are awesome to me. When it comes to politics disads, the most important part is the link because it is the weakest component, logically speaking. The key to winning politics/elections scenarios is painting a picture of how the aff disrupts the process of passing X bill or interfering in voting blocs. Be very clear on the line by line and debating the warrants, not just doing tagline explanations and extensions. I don't like rider DAs and I would like the 1NC shell to make at least some sense.\nImpact Turns: I messed with these arguments a lot during my career and I think I know how these debates should work out. I think the most important components of the impact turn is winning a timeframe differential and winning that the world of aff solvency would lead to is substantially worse than the squo (i.e. rapid modernization in China creates a worse war later than one that would happen now).\nCounterplans: I'm all about CPs but too often have I had to hear and deal with nonsense process, agent, or consult CPs. I think that a good CP strategy should be well researched and have a solvency advocate for the aff. When it comes to CP theory, most violations are reasons to justify a permutation or call solvency into question and not as a voter. Personally, though, Consult CPs are the most cheating and I have sympathy for affirmative teams that have to deal with them.\nTopicality: I don't really know how the community feels about topicality anymore, but it is still one of my favorite 2NRs to give and hear. A good T 2NR consists of good impact work and comparisons of interpretations. Too often do I hear extensions of interps without comparing the models of debate that both interps would provide.\nKritiks: I'm not the most well-read in critical literature, but I know the basics of most Ks. This being said, the burden is on you to explain what your argument is and how it is impacted out. Do not just extend the arg without impacting it out because a nebulous claim about something doesn't mean anything without an impact. A large part of Ks that I have trouble understanding is the alternative because a lot of times, the negative isn't explaining the world/research model of the alt which leaves me confused about its application in the world or in debate. On the converse, the affirmative many times doesn't capitalize on the lack of explanation that the negative has forwarded which means that usually end up assuming that the alt does something to resolve the link offense. Don't be afraid to call out the bad explanation that the other team is giving because odds are if they aren't articulating the arg well, I will be skeptical to agree with their characterization of it. Framework is important and filters how I should evaluate the rest of the debate so prioritize that in your strategies.\nPlanless Affs: I've never read these in my career, but I understand their utility and structure. I prefer to hear a planless aff that is related to the resolution. I hold both teams to a high standard of clarity and explanation. For the aff, I need to know what the aff does and how the end goal of the 1AC is achieved. For the negative, you need to engage the aff and call solvency into question. Framework is, of course, a good strategy for the negative, but do not think that just because I am unfamiliar with the aff's literature that I am predisposed to vote for you. Stale framework debates are awful and I would like to hear a nuanced strategy that actually makes sense. The aff against framework shouldn't just shotgun DAs to the interp and think that's sufficient. You should focus on your best source of offense and contextualize it to the neg's interpretation and how your model of debate is better/more educational/more ethical.\nCondo: I think that up to 3 advocacies are fine for me. Anything more and I am more sympathetic to the aff. Don't get it twisted, if the neg screws up debating condo, I will vote aff.\n****PF Paradigm****\nI am did not compete in this event but I have learned the very basics of how a round is structured. I will likely evaluate a public forum round just like a would a policy round with a heavy emphasis on impact calculus and warranted analysis.\n\nFeel free to ask me anything before the round. Be respectful and Compete.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Brittany  Berg",
        "school": "Claremont",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Shabbir  Bohri",
        "school": "The Quarry Lane School",
        "paradigm": "Last changed on\nMon October 4, 2021  at 2:55 AM CDT\n\n\nCoppell '21 | UT Dallas '25 | He/Him\nConflicts: Coppell (Former Debater: 2018-2021), Quarry Lane (Public Forum Coach: 2021-)\nContact Info: Facebook Messenger or Email (shabbirmbohri@gmail.com)\nDebate Basics\n\n*** UPDATED 2021 ***- In an effort to minimize prep stealing, speech docs before constructive speeches are mandatory. If you are reading a paraphrased case, send the cards with it. Send speech docs (i.e. word documents or pdfs, even a link to a google doc is fine) and not your paraphrased case + cards in 4 separate emails. If you refuse to send a speech doc - I will cap your speaks at a 26.5.\nRefer to the updated speaker points section for NEW specifics.\nDebate should be an educational and safe space - No violence of any kind towards anyone in the round will be tolerated and the round will be stopped if deemed unsafe for an individual in it.\nI'll try my best to adapt to you - debate the way you want and enjoy the activity\n\nOnline Debate\n\nCameras on at all times.\nEstablish a method of evidence sharing before the round starts.\nIf you get called out for stealing prep and you clearly are, speaks will be low. To avoid this - stay unmuted when a team is sending evidence over.\n\nPublic Forum Basics\n\nI'll vote off of the least mitigated link chain with an impact at the end of the round\nExtend the arguments themselves - the names of each author aren't required\nTo make an argument into a voting issue, it should be extended in the latter half of the round, warranted throughout the round, and weighed against other arguments\nHave tangible impacts (extinction works) - statistics about the economy growing don't count, and reading \"x increases trade and a 1% increase in trade saves 2 million lives\" doesn't make the impact of your individual argument 2 million lives either\n\nPF Rebuttal\n\nFrontlining is required in second rebuttal - if you drop offense it's conceded, and defense on an argument you collapsed on should be frontlined or it'll be an uphill battle\nLink turns need uniqueness responses to make them into a link turn and access the impact of the contention, otherwise it's just another contention with no impact\nEach response should have a warrant - you can read as many as you'd like, but no warrant means it doesn't matter\nDumping DA's in second rebuttal is can be made into a voting issue, but I don't have a predisposition on this issue\n\nPF Summary/Final Focus\n\nAny argument (defense or offense) that wants to be a voting issue needs to be in both speeches - sticky defense doesn't exist\nExtend and weigh any argument you go for\nArguments not responded to in the previous speech are conceded - just call it that and extend it and move on\nMetaweighing is good but hard - try your best to do it when needed and you'll be rewarded\n\nTheory\n\nMy outlook on theory has changed after specific rounds this year - IF you are in a Varsity division at any tournament, ANY theory is fair game - I think being unspecific on this issue has led to a lotta non-tech decisions from myself which penalizes debaters for wanting to win with no negative intention of reading theory. I will evaluate ANY shell, but friv theory still remains to have a very low threshold for responses from me.\nIn a Varsity division - Small school based arguments or arguments that bring up equity issues that theory exacerbates will not win you the shell. There are SO MANY resources to learn how to debate this - PF Forward, The Debate Group, reaching out to debaters, etc. Worst comes to worse - reach out to me if you'd like some tips.\nMisgendering or Content Warning based arguments are highest in the hierarchy of theory arguments here - if there's clear abuse then I encourage you to read these arguments\nArguments about evidence ethics (paraphrasing, disclosure) or in-round unfairness (miscutting evidence, dumping DA's) are fine - check evidence section below for more info\nOut-of-round abuse cannot be adjudicated by me (with an exception to disclosure) - this stuff needs to be reported to your coach or the tournament's committee if a reportable offense\nDefaults include CI &gt; Reasonability, DTD, RVIs bad\nFrivolous theory is just uneducational and dumb\n\nOther Progressive Arguments\n\nAny argument, as long as it is warranted and impacted out is fair game - limit jargon on uncommon arguments or kritik's\nLayer arguments for me - there isn't a set in stone way to evaluate multiple types of progressive arguments in a round and they are up for interpretation here\n\nEvidence\n\nEvery piece of evidence needs to be cut - you can choose to paraphrase but must still have cut evidence for it\nIf you take more than 2 minutes to find a piece of evidence, speaks will be low.\nMake evidence issues part of the debate rather than out-of-round issues - each team should be given a chance to justify the abuse or explain why it warrants a loss\nI'll never call for evidence unless explicitly told to - if you want me to read evidence don't just call it bad and tell me to read it, take the time to explain why you believe it's bad if it's a critical part of the debate\nIf a team can win by reading cut cards only, you're guaranteed a 29 minimum\n\nSpeaker Points\n\nUPDATE (October 2021) - To get a 30 guaranteed, you must email both constructive and rebuttal speeches on the email chain prior to the speech - this MUST include cards.\n+0.1 if you disclose on the NDCA PF Wiki, +0.1 if you read cut cards in case\n\nPost-Round Info\n\nI will always disclose as long as the tournament allows it - if they don't, shoot me a message on messenger and I will\nPost-round, but I won't change my decision - this should be a means to learn what you could've improved on instead of trying to get me to change my ballot, which isn't possible\n\nNovices (Any Event)\n\nCollapse. Most rounds are lost by going for too much and not explaining the most important arguments enough. Choose only a few (one is fine of course) arguments to have in your last speech and explain it/do impact calculus and compare it to your opponent’s argument.\nClarity. Go at a pace you feel comfortable at, there isn’t always a need to match your opponent’s speed and make sure that speed doesn’t sacrifice the clarity of your arguments. This also relates to the order of your speeches: Be clear when responding to different arguments and label them as such (i.e. “Moving on to their argument about Military Spending”). This makes it much easier to follow along and catch everything.\nComparison. A bit repetitive but important to understand: comparing (doing impact calculus) is the most important way to win a round. Usually both teams are winning some argument on their side, and the way to ensure your argument comes above theirs is to give reason as to why it does.\nCritical Thinking. This is good for speaker points and even winning the round. You won’t have responses to every argument and so using outside knowledge or analytical arguments that rely on logic are more likely to be stronger in rounds. Don’t be afraid to use what you know.\nOther than this - I’m open to any arguments being read as long as you explain them and follow some of the suggestions I’ve outlined. I understand that being new to the event can be difficult at first so I want to make sure you are getting as much out of the round as possible. If you have any questions about an argument, my decision, or the event in general, feel free to ask me after the round or shoot me an email. Good luck!\n\n\n",
        "rating": "Tech"
    },
    {
        "name": "Madison  Cahill",
        "school": "Southlake Carroll",
        "paradigm": "Last changed on\nTue September 14, 2021  at 7:37 AM PDT\n\n\nGraduated from La Salle College Preparatory in 2021\nAttending Hawai'i Pacific University studying History and competing casually in debate here.\nWent to TOC in 2020 in Public Forum\nI am a flow judge. I will vote on the cleanest issue on the flow in the round so try not to waste your time on things that have gotten too muddled throughout the round. I ran K's and theory in high school in Public Forum so if you know how to introduce that into the round correctly I am totally in support. However, don't try to run a K or theory without basis and in out rounds make sure that is something all your judges will both understand and be willing to vote for. \nThe easiest thing to vote off is weighing in a round. If you do not weigh your arguments I have no idea how to evaluate or vote for them. I debated on the Nat Circuit Level frequently so I am fine with speed. Please ask questions and you are welcome to postround as long as its helpful.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Brian  Cho",
        "school": "Oxford Academy",
        "paradigm": "Last changed on\nTue April 6, 2021  at 8:47 AM PDT\n\n\nHi! I'm Brian, and I'm a student at Cypress College. I've had 3 years of experience in Highschool IE's (Impromptu, Extemp, Duo), and I was my school's Impromptu/Extemp Captain for 2 years. If you have any questions, feel free to ask me before your rounds! I have been doing debate for 3 years in my high school and I am comfortable with LD, I have also judged college debate for my 2nd year of college, judging PF, Exempt, and LD.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Vivek  Chudasama",
        "school": "Mountain View High School",
        "paradigm": "Last changed on\nSun September 19, 2021  at 8:29 AM PDT\n\n\nGolden Rule: Be nice to your opponent. Not too aggressive, not mean, treat each other with respect. If I see you are not being nice, I will lower your speaker points.\nAlso, a quick preface to this paradigm. I know it seems scary that it's so long, and I'm not here to intimidate you, I just find it fun to have a long paradigm full of references and humour, in an effort to lighten the situation (and make me look more knowledgeable HAHA). If this is scaring you, I promise that is not my intent; I'm not a scary guy (or at least, I try not to be lol). Now, read on :)\nA Brief TL;DR Of This Excessively Long Paradigm\nNah, no TLDR. It's your round, make sure you read and understand everything, and please ask me if you don't. I suggest listening to Writer in the Dark by Lorde while you read this.\nA Tad About Me\nHey, I'm Vivek! I'm currently a college student, and previously served as PF Captain for Mountain View-Los Altos Speech and Debate (los altos &gt;&gt;). I'm a massive Taylor Swift fan (like my top played artist in 2020 oop), which makes me sound very basic, I'm aware. In my free time, I enjoy watching TV, going on car drives, eating, spending time with friends, etc. I'm excited to see y'all debate (I may scroll through Reddit if I'm bored, jkjk); below is a (very) comprehensive paradigm on what you should be doing to tailor to my preferences.\nAlso, my pronouns are he/him.\nLying\nLook..... just don't lie. I used to have a whole paragraph here about not lying, but honestly, if you've made it this far, you know how bad lying is. If you're going to win, do so the right way.\nSpreading\nDo not.\nSignposting\nDo! I need to know where to flow.\nOff-Time Roadmaps\nOh god yes please. So helpful.\nCrossfire\nJust answer your questions well and ask good questions. Don't give like super long answers, because that wastes the crossfire time for me and your opponents. If you want to elaborate, do so in your upcoming speech. At the same time, I don't flow crossfire, so even if you don't do so great, that will only be reflected in speaker points, not in my ballot.\nFramework/Standard\nIf you do not list a framework, I will use your opponents'. Please list one, or you may end up regretting it.\nImpacts\nThis is important, list your impacts, it helps me know who is helping the most people in the rounds. It doesn't necessarily need to be quantified, but it could be helpful for magnitude weighing.\nWeighing\nTaken from the paradigm of Daniel Fernandez.\nDon't just make arguments and respond to your opponent's arguments; invest time to explain why the arguments you make the matter more than the arguments your opponent makes. The earlier you start and the more often you bring up your weighing, the better!\nOne note on weighing: I would advise teams against saying that their arguments are more likely than their opponent's arguments because the strength of weighing comes from the ability to accept your opponent's argument as true and still win the debate by demonstrating why your own argument matters more. When you argue that your argument is more probable than your opponent's, you put the added burden on yourself to win their case because you need to win a reason why their argument is not true or improbable. You should always seek win-win the debate by winning the fewest amount of arguments.\nExtend\nExtend your cases and refutations all the way through Final Focus so I know you didn't drop anything! If you drop something, I probably will not consider it in my final delegation. I once lost an eliminations round at Berkeley because I didn't extend one point in summary :( ......so, extend!\nSpeed/Pacing\nI'm fine if you want to go fast, just don't go super-duper spready fast (spreading = bad. sry policy and LD!). Also, have a constant pace, don't speed up and slow down - time management!! Plus, speak clearly! If I can't understand you, then I might drop your point by mistake!\nArguments\nJust don't be offensive, and also run creative arguments! Feel free to run squirrelly arguments. Plus if you make me laugh (yay!) I will probably raise your speaker points. :)\nEvidence\nSome may dislike me for this, but for evidence, I follow Charles Schletzbaum's preferred rule - NSDA Public Forum Rule #7.1B. In accordance with this rule, please have the author's name and date, along with their agency (ex. for Jones from the Mayo Clinic in 2013 would become Jones 13). I may call for cards, so be ready for that, and don't have any sketchy/shady evidence (debate math discussed below).\nDebate Math\nEh. I used plenty of sketchy debate math myself throughout my debate career, so I can't really fault you for this one. Just make sure it makes sense in context of the actual world, and that you have the statistics to back it up.\nSpeaker Points\nTaken from the paradigm from Christian Jochi Vasquez :) :\nMy average is a 27 for the losing team and a 28 for the winning team. I think speaker point inflation is pretty ridiculous these days. A 30 to me means that there is nothing I can critique about your speech and it was perfect [Vivek's edit – look for ways to improve speaker points below]. Somethings that can help you with getting a higher score:\nA) Voting issues, not just blind extensions. Talked about this a bit up above. I want to hear real weighing in the round, and that means actually applying some form of calculus to the arguments. I think categorizing arguments into broader issues allows you to do this. Feel free to prove me wrong though, and I mean that sincerely.\nB) I like clever lines of questioning. In PF this is a little bit more difficult to do, since crossfire is double-sided but I think it can still be done. You're never going to get a good opponent to concede some major point by just blatantly asking if they're wrong. Rather, asking small questions that build up and setting a trap is not just strategic, but makes me impressed as a judge\nC) Jokes. I like to laugh and smile, but lately a lot of rounds have done the opposite for me.\nFun ways to get better speaks (for a maximum of 29.25 points - the rest must be from your actual speaking) :)\nFirstly, I'd like to preface this section by saying that I want to make debating less stressful for you, and more entertaining for me. Therefore, I include this section, because it's so much fun to hear y'all's amazing references and stuff - please try to include like at least one reference to a show/movie listed below, because it's fun for everyone and makes the atmosphere just generally more comfortable. As a debater, I have never had a judge give me the option to reference entertainment I like (and believe me, there have been a lot of situations where I could have) - I want to be the judge that gives you a creative platform, so while the debating aspect is still pretty serious, you can also have a bit of fun with it :)).\n- Puns in speeches (but NOT in contention titles): +0.25 speaker points\n- Incorporate the first line of \"All Star\" by Smash Mouth into your rebuttal or summary in a way that makes sense: +1 speaker point.\n- Reference one of these (and it must be a clear reference, I suggest making analogies to situations. It cannot just \"Aang said 'war' once and so did I,\" have something tangible. And feel free to ask me for a review on any of these, I will let you know if it's good or not): + 1 speaker point:\n(*clears throat*)\nATLA; LOK (omg the ending, my heart &lt;3); MCU (including Deadpool (1&amp;2), AOS, Daredevil, MCU Disney+ shows; ps Daredevil is amazing); Breaking Bad/El Camino/BCS (but not s5 of bcs); DCEU (including The Flash, Arrow(s1), Doom Patrol, Gotham, Lucifer); Michael Schur Universe (The Good Place, The Office, Parks &amp; Rec, B99); Dan Harmon shows (Community, Rick and Morty); The Umbrella Academy; Star Wars (including Clone Wars, Rebels, Mandalorian); most things Disney (ask for clarification); Disney Channel Shows! (GLC, DWAB, A&amp;A, L&amp;M, Jessie); Stranger Things; Kim's Convenience; NBA stuff in general; Any Harry Potter movie/books; Literally anything Rick Riordan; Crazy Rich Asians (one of my all-time fav movies, and the books are solid too); legit anything Taylor Swift (omg my fav, like....champagne problems? paper rings? illicit affairs?? we stan!! lmk if you want recs); also anything Ben Platt, he ruled my high school junior year (what is it with sad music and junior year? hmm); The Last Dance; Columbo; Once Upon a Time (the writers of this show are so good); New Amsterdam; Johnny English (any of the three films, but preferably #2 because that's my favorite oop); Die Hard (1,2,3,4); Feel Good (I went into it thinking it would be okay. It was amazing. Again, PG please); Bridgerton (I caved into the trend oop, and probably lost a few hundred braincells because of that); Rocky (1,2,3,4,5,6); Creed (1&amp;2); The Karate Kid (I,II,III); Cobra Kai (ahh i love this show); The Queen's Gambit. Basically, you've got options here. It's an easy speaker point. Do it. Please. Make me laugh. I am starved for entertainment (and, yes - i see the irony).\n- Rap your summary/final focus: 2 speaker points\nGet 30 speaks 101\nThere are two ways to get a 30:\n1. Reference She-ra and the Princesses of Power. I doubt anyone will have watched it, so if you have, that's a bonus for you.\n2. Roast your opponent's case. However, not just a simple, boring roast, it needs to be a really unique, brutal comment. Again, DO NOT attack your opponent personally in any way – I would never advocate for that. If you're going to attempt this, go for their arguments. Also, I decide whether your roast is 30 points-worthy.\nTheory/Kritiks\nHmmm, theory and K's and similar stuff are very interesting, but I have no real idea on how to weigh them in context of the round lol. I completely understand Abigail Spencer's gender K, and do agree that is a problem in public forum; if such a situation (or other situations with similar severity) arises, definitely feel free to address it. However, don't run theory or a K just for the fun of it, as it will probably backfire on you. If there really is a legitimate reason to run the K or the theory, then of course I encourage it, but if not, then just don't.\nDisclosure\nEh. As a competitor, I understand wanting a judge to disclose. Therefore, I will try my best to disclose; however, if I'm just not feeling it, I may not disclose, and that's no reflection on your abilities to debate, I'm probably just having my own personal reservations to doing so (which can and will be influenced by numerous external factors, not limited to the round).\nNon-PF rounds\nIf I'm judging you in Parli, LD, or Policy, I probably have no clue how to judge your round lol. Parli, I can get by (preferably keep the theory to a minimum). For LD I can also sort of understand, but weighing the morality aspect of the round can be confusing, as PF doesn't have anything like that. Policy..... I have no clue mate. I just hope that nobody assigns me policy rounds (hint hint tab).\nExtra! (Though probably also helpful to read)\nDon't title your contentions with something punny, like \"Big Bad BRI\" (from the BRI topic in Septober 2019). As much as I like puns, preferably not in your contention titles, as I want to know what the contention is about. If you can find other places to incorporate puns/jokes, then feel free to do so!\nAlso, please don't start your speeches with \"I'd like to thank the judge for this round, I'd like to thank my opponents yadda yadda yadda\" because it's so, so, so infuriatingly pretentious.\nFor all intents and purposes, I am a flow judge, but definitely also go for lay appeal lol. While I generally don't vote based on perceptual dominance, instead on your arguments, it does unconsciously factor into my decision (I am human, after all).\nYou can probably count on me having some background information on the topic, but it will definitely not be anything specific; now that I'm no longer debating, I don't have the proximity to these topics, and I'm not really staying updated about the Baltic States or the South China Sea in my free time.\nI may have already added this somewhere, but I'll reiterate it here. I support sticky defense, but that is only if the evidence/argument has gone unresponded to by your opponents by the end of the round. Sticky offense is not a thing; please extend.\nWatch this. It is so cute.\nAnd at some point, please read this. It was written by a good friend of mine, and points out some very interesting points on debate itself. And on that note, please treat sensitive issues as sensitive issues.\nI'm going to leave you with a life tip (which implies that I've lived long enough to experience much more than you all, which really isn't true, but whatever heh). Public Forum Debate is one of the most interesting, inclusive, and exhilarating activities I have ever done. I have gained an entire second family here, one I converse with daily and trust with all of my heart. Public Forum will always hold a special place in my heart, and nothing could change that. That said, competition often transforms debate into a very toxic atmosphere to be in. In round, do not ever create any kind of \"beef\" with your opponents. Treat each other with respect, and just be polite. While this is an important point for debate, the real world is a very toxic place as well - just try to be the nice person. Everybody is going through something: maybe their parents are having a divorce, their grandfather just died, they just broke up from a long-term relationship. Don't add to their internal problems. In rounds, debate your hearts out, but do not go for any personal attacks. Don't say anything that can be perceived offensive, including acting homophobic, transphobic, racist, sexist, anything of the sort. At that point, I will drop you if you're actively contributing to debate's toxicity. Just be nice.\nNote for 2020-2021 and 2021-2022 season of debate. Please do not sit with your partner, on the same screen, together (AKA not social distancing). Not only is it not safe for you and your partner, it's just annoying because there are so many teams that get disadvantaged for taking the proper safety precautions.\nWith that, good luck everybody.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Collin  Connor",
        "school": "Hire",
        "paradigm": "8 rounds\n\n\n\n\n\n\n\n\n\n\n\nLast changed on\nSun September 19, 2021  at 3:50 PM EDT\n\n\nBackground: I am a 4 year former high school debater competing in the West Virginia, Pittsburgh, and National circuits. I am a strong proponent of a student run round (keeping track of your speech time, prep time etc.) That being said, the judge is the arbiter of the round. While I encourage discussion and asking questions, please be respectful to both the judges and your competitors. If I am alone judging, I will make the final decision about an given issue, and if I am on a panel of judges, I will yield to their opinions unless my input is needed. During my debate experience I found that nothing bothers me more than disrespectful, condescending, and rude debaters. Now as a judge, being one of the aforementioned competitors is a guaranteed way to lose points and/or the round.\nPublic Forum:\n1. Speed- When it comes to speaking in Public Forum, I have no preference as to how fast you speak. As long as you are coherent, you can speak at whatever speed you'd like. Spreading does not bother me, though I do often find that spreading overall weakens the points you are trying to cover.\n2. Argumentation- When it comes to argumentation in public forum, I like when competitors weigh impacts or their contentions. A well developed contention is great, but if I don't understand how it impacts the world I live in, it doesn't hold a lot of weight. I prefer empirical arguments rather than theoretical and hypothetical, though if both teams decide to argue this way, I will not object. I think the stronger side is not only the one that extends their case, but who also refutes their opponents case and their arguments in response to their case. I think the best use of the summary speech is to respond to the opponents rebuttal, and save the key issues and weighing for the final focus. I will vote solely on what you tell me to, but if I am not presented with issues to vote on, my decision will ultimately come down to who wins more individual points.\n3. Evidence- Paraphrasing in PF is okay, but you must provide the source. If you don't cite your source, the evidence will only be upheld if the other team doesn't clash or provide different evidence. All evidence has to be accessible to your opponents (and to me should I call for evidence after the round). Give evidence in an efficient manner. I won't start your prep time on reading evidence until your opponents hand it to you and you start reading and I'll stop your prep when you stop reading. I usually won't call for evidence after the round, but if the context or validity of a source are important to the debate, that evidence should be readily available for me to see after the round has concluded. If your evidence is called for, and you cannot provide it, any arguments that are based on or supported by the evidence will be automatically dropped.\n4. Format- Please do signpost(roadmap) before any extemporaneous speeches so I know exactly what I will be listening to. You may do this offtime, so that the time of your speech can focus on content. You may time yourselves, but I will stop flowing once your time is exhausted.\nCrossfire- I don't flow cross, but I will listen. If something important is said, be sure to bring it up in a later speech.\nIf you have any other questions about judging preferences, please ask me before the round starts.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Matt  Conrad",
        "school": "La Reina",
        "paradigm": "Last changed on\nWed September 2, 2020  at 7:37 AM PDT\n\n\nYes I want to be on the email chain mattconraddebate@gmail.com.  Pronouns are he/him.\nMy judging philosophy should ultimately be considered a statement of biases, any of which can be overcome by good debating. The round is yours.\nI’m a USC debate alum and have had kids in policy finals of the TOC, a number of nationally ranked LDers, and a state champion in Original Oratory while judging about a dozen California state championship final rounds across a variety of events. Outside of speech and debate, I write in Hollywood and have worked on the business side of show business, which is a nice way of saying that I care more about concrete impacts than I do about esoteric notions of “reframing our discourse.” No matter what you’re arguing, tell me what it is and why it matters in terms of dollars and lives.\nPolitically, I’m a moderate Clinton Democrat and try to be tabula rasa but I don’t really believe that such a thing is possible.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Maribelle  Cruz",
        "school": "Notre Dame San Jose",
        "paradigm": "Last changed on\nFri February 7, 2020  at 2:12 PM PDT\n\n\nI have been a judge associated with Notre Dame High School since 2018 as my older sister is the director of speech and debate there. Tournaments I have judged include invitationals and state qualifiers. My experience includes debate events such as public forum and Lincoln-Douglas, as well as interpretative, oratory and extemporaneous speech events. My debate judging style focuses on the value criteria of net benefit or maximizing welfare. If I feel the proposal would potentially do more harm than good compared to the status quo, I would vote for the negative. If the proposal seems to be more beneficial compared to the status quo, I would vote for the affirmative.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Maneesha  Dalmia",
        "school": "Mission San Jose High School",
        "paradigm": "8 rounds\n\n\n\n\n\n\n\n\n\n\n\nLast changed on\nSun November 22, 2020  at 1:11 AM PDT\n\n\nMy kids wrote this for me: I'm an experienced parent judge who has been judging for 5 years. I like turns (sometimes I'm even ok with impact turns), weighing and impacts. I hate bad evidence, and will call for cards if I think evidence is suspicious.\nI'm familiar with some jargon, but not all of it. I don't really know how to evaluate theory or K's. Please be civil during cross. I do understand the flow, I just don't use jargon to describe it. I will know if you dropped something. FF matters a lot to me.\n\n",
        "rating": "Lay"
    },
    {
        "name": "Surendra  Dara",
        "school": "Honor Academy",
        "paradigm": "Last changed on\nWed January 27, 2021  at 6:44 AM PDT\n\n\nHi! I am a lay judge.\nI dislike spreading and value interacting with your opponent's arguments well.\n\n",
        "rating": "Lay"
    },
    {
        "name": "Ben  Denton",
        "school": "Pinecrest High School",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "eddie  diaz",
        "school": "Westridge School",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Kristen  Dickson",
        "school": "Hire",
        "paradigm": "Last changed on\nSat January 16, 2021  at 8:46 AM PDT\n\n\nHello all!\nI am a first year judge, and this is my first paradigm as well. I competed public forum and speech in both the CHSSA and NSDA circuits for four years, but my focus was mainly in platform and interp events. That being said, I have a solid grasp on on all debate events.\nMy performance philosophy has always been to nail the technical aspects of a piece/argument before introducing nuances; a strong foundation ensures that the audience will come away with a baseline understanding of the subject matter. When I'm judging, I examine technique (storytelling and blocking), energy (emotion and consistency), as well as relevance and individuality.\nFor debate specifically, I prefer to judge rounds where competitors do not spread. Oftentimes the feedback I give will include holes within an argument or a piece of evidence I think you can include. That being said, I do not judge what could have been said only what actually was said. Plus, I flow throughout the debate. \n\n",
        "rating": "Tech"
    },
    {
        "name": "Lori  Donnelly",
        "school": "Potomac Debate Academy",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Avnika  Dubey",
        "school": "Duchesne Academy Of The Sacred Heart",
        "paradigm": "Last changed on\nFri January 29, 2021  at 9:07 AM CDT\n\n\nQuick TLDR - I vote off the flow to the best of my ability. I value quality of argumentation over quantity, please collapse, warrant, and make it OBVIOUS in Sum and FF who is winning (weighing, point out drops, concessions - this is gonna be one of the biggest things I look at). With all that said, come in with your amount of experience, and I will evaluate you fairly. Debate is a weird game, and not everyone has the same access to the tools \"normalized.\" Don't worry, do your best, and know we are all here to learn.\nBackground: I am a recent graduate from Duchesne Academy, and I have been a second speaker in PF for three years. I debated on the local and national circuits and consider myself to evaluate rounds pretty technically. I also did speech on the local and national circuit, but you defs don't want me judging that.\nBasic Judging Philosophy: I vote off of what is warranted, I prefer what is weighed. If you make a well-structured argument, then give me reasons to prefer your warranting over their warrants, and finally do weighing that COMPARES your impact to their impact, and tells me why yours is more important and WHY it's more important. Don't just say a buzzword like \"scope\" and move on.\nHere are some more specific notes\n- Jargon and Speed: Honestly, I can handle a fair amount of speed, just please don't spread. Also, its important to make sure you don't exclude your opponents from the round; spreading as a tactic to lose your opponents is really inconsiderate in my opinion. If everyone in the round is cool with jargon, I'm fine with it too.\n- Evidence: Love it. Please note that I usually flow ideas, not card names, so feel free to extend your evidence but make sure you extend what the evidence says. Please make sure evidence is exchanged quickly- if it isn't, speaker points will be dropped. Citations are needed, and at a minimum must be an author and a date, but more information is always better. Feel free to go after poor-quality evidence in round, I love a good indict (always exciting).\n- Topic Knowledge: (tailored for the Beyond Resolved Tournament) - I am going to be honest, I don't know much about this topic. I will do my best to inform myself on the basics before your round, but you really need to pretend I don't know anything. I can pick info up quick so explain it effectively and you'll be fine. :D\n- Rebuttal: Pretty short here. I think 2nd rebuttal should defend case. Disads in first rebuttal are cool. Second rebuttal they are sketchy. Make sure you tell me where you are on the flow, and I reeeaaallly like numbering your responses to things, it makes flowing easier for everyone.\n- Summary: This is a hard speech; I have no idea how my partner Danielle did this. I expect you to reiterate and defend your case with warrants AND extend responses on your opponent's case while still weighing. I don't care how you structure it so long as it is logical for me to follow. First summary I will be a little more lenient towards, but you still need the previously mentioned things at a minimum. YOU HAVE TO COLLAPSE IN SUMMARY. Make a few, strong arguments and win them, and you will win my ballot. Weighing should be in second summary.\n- Final Focus: Mirror the summary speech, collapse and warrant your few arguments even harder. Don't make new arguments or new weighing metrics, please. Warrant and weigh what you have to work with and you'll be fine.\n- Crossfires: I won't be flowing them, I might listen in, but if you get an important concession, mention it in a speech! Debaters are bound to what they say in crossfire, so don't lie. Remember to be kind; I take note of that intensely!\nTheory/Kritiks: I am not very well versed in T/K; I wouldn't do it infront of me tbh. Sorryyyy!\nDecorum: Please be nice; it shouldn't be hard. I'm not flowing cross, and I frankly don't value it that highly, so please don't turn it into a screaming match - instead, try to get valuable/strategic info out of it. If you are rude, racist, sexist, homophobic, or take another obviously unacceptable actions, I will 100% drop your speaks as low as I can and, depending on the infraction, it will affect my decision. So please, be kind. Debate is stressful, don't make it harder than it has to be.\nSpeaks: Honestly, the idea that public speaking skills should be valued excludes people from the debate space. I will give speaks solely off the quality of the argumentation you make in your speeches and your ability to signpost so it is easy for me to follow you on the flow. If you are one of those people who are \"dominant in cross\" and are rude to your opponents, I will drop your speaks (not joking). In short, the best debaters with the best structure will get good speaks, not the best speakers.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Andrew  Dunn",
        "school": "Hire",
        "paradigm": "8 rounds\n\n\n\n\n\n\n\n\n\n\n\nLast changed on\nSat September 25, 2021  at 8:42 AM CDT\n\n\nExperience: I am a senior at the University of Iowa where I study political science, international affairs, and philosophy. I was a competitor in public forum for 6 years and was the collegiate national champion in 2018. I have experience and working knowledge with all speech and debate events. I have previously coached in Des Moines, Iowa, and for NSDA China. I am currently unaffiliated with any team, school, or individual competitors.\nPF: I value accessibility. Public forum ought to be an event that is able to be understood by any member of the public. Clear, concise communication at a reasonable speed is expected ie conversational. I WILL DROP YOU IF YOU TRY TO SPREAD. Each team will be given one warning on speed in the form of a dropped pen or calling out “Speed.” If spreading/speed persists after the warning I will immediately drop the team with the most violations. (If both teams accumulate one violation in their respective constructive, the next team to violate will be dropped.) I will flow cross-examination if you make important points. I value complex arguments and respectful clash. Being rude in my rounds is a great way to lose speaker points and a round.\nImportant things:\n- If at all possible, I would like to start rounds early. I understand that's not always possible or teams need to prep, so I'm just appreciative if we do start early. No problem if you need to take your time though.\n- While in evidence exchange, I expect all students to have their hands on screen and mics unmuted to ensure that time is not used for prep.\n- Summaries should SUMMARIZE the round.\n- FF should Crystalize not line by line, give me impact calculus and weighing. Impact calc within every speech is most persuasive.\n- Summaries and FF should have voters not line by line.\nTL;DR, Be respectful, conversational, bring solid evidence and analysis to my rounds and you’ll do fine.\nLD/CX: Pretty much anything goes. I absolutely prefer arguments that are directly resolutional (ie not a fan of certain Ks, love me some T and theory though) but if the debate goes a certain way, it is not my place to wrangle it. LARP is chill. On the rare occasion, I may ask you to slow down a little bit or clear you, but that will not be weighed against you. I'm almost always good with speed. I prefer competitors disclose to ensure flow clarity. I will flow cross-examination if you make important points.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Nicoleta  Enciu",
        "school": "Hire",
        "paradigm": "8 rounds\n\n\n\n\n\n\n\n\n\n\n\nLast changed on\nSun September 19, 2021  at 7:17 AM PDT\n\n\nHello! :)\nI'm a policy debater in uni.\n--------------------------\nPreferences:\n- Have a road map and sign post -\nclear road maps and sign posting = better understanding of what arguments are being used = clear flow = higher chance of your win\n_______________________________________________________________\n- Can spread, but emphasis your main points (slow down, deliberately tell me, repeat it a few time, etc.) -\nby emphasizing a certain point, you give it value and in turn I give it value and know what you want to argue for. makes your point clear and understandable so I can easily write it down in my flow\n_______________________________________________________________\n- Tag teaming is fine -\nmake sure you speak eventually since cx is a part of your speaker points. I can't evaluate speaker points properly if I don't hear you in both speeches and cx. (example: if you mumble a speech and don't really participate in cx, it generates a lower score then mumbling a speech and participate in cx)\n_______________________________________________________________\ntry not to say \"is anyone not ready?\" it's a very awkward phrase with bit of a negative connotation, but don't worry if you do say it, it won't really affect your speech score. it's just very weird to hear it and \"is everyone ready?\" is quicker\n---------------------------------\nAlso be kinds to others. It's not fun being in a round where there is malice.\nSee you in a round!\n\n",
        "rating": "Tech"
    },
    {
        "name": "Christopher  Eppich",
        "school": "The Cambridge School",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Benson  Fang",
        "school": "Poolesville High School",
        "paradigm": "Last changed on\nSat July 24, 2021  at 2:30 PM EDT\n\n\nLeland High school 2021 \nCornell college '25 \nDebated for 4 years for Leland, did ok.  Mostly under the code \"Leland FS\" for those who want to stalk \nParadigm Stolen from Karsen Wahal: \nHow I vote:\n1. Who is winning the weighing?\n2. Who is winning a link into that weighing?\n3. If no one is winning a link into any weighing, then I'll either find the best remaining offense, or, if none exists, presume whoever lost the coin flip (that'll be rare, though).\nTech &gt; truth, but I'm probably marginally more inclined towards truer arguments.\nI debated pretty quickly and I'm totally good with PF fast, but not policy spreading. If you do really want to spread for some reason, at least provide a speech doc.\nSecond rebuttal must frontline -- all turns must be frontlined and frontline the argument you're going for.\nWeighing is the most important thing for me, and it's typically how I evaluate rounds. Give me warrants for your weighing and do clear comparisons (don't just use buzzwords).\nTell me why to prefer your arguments -- give me impact comparisons, link comparisons, evidence comparisons. If you do that effectively, you'll almost always win. Sidenote: Probability weighing is fake 95% of the time, but if you warrant it well, I'll buy it. If it's the only other weighing in the round, I'll probably also buy it.\nWarrant everything. Don't just extend your impact, extend your whole argument.\nPlease collapse.\nLogic is great -- evidence is better, but I'm more than willing to vote on well-warranted logical turns or defense.\nIf you do cooler weighing mechanisms than just scope/magnitude etc., you get bonus points.\nDefense is sticky, but if defense is frontlined, it must be responded to in the next speech.\nSignposting is important. Tell me how to vote in FF (treat me like a lay judge in your final focus).\nI won't call for evidence unless a) it's contested in the round and it'll affect my decision or b) I just think it's interesting. But please don't misconstrue evidence: if it's really horrendous, I'll drop you for it. Progressive argumentation is fine, but I didn't run theory/Ks in high school. Run it at your own risk (I might not understand it at all).\nCross: I don't pay that much attention, and don't flow it, so if something important happens, tell me. I'll pay some attention though, so don't screw around too much.\nPlease time yourselves.\nI appreciate humor.\nMost importantly, don't be exclusive. To anyone. Period.\nI'll almost always disclose. Feel free to ask questions.\n\n",
        "rating": "Lay"
    },
    {
        "name": "Marshall  Feuer",
        "school": "El Camino Real Charter High School",
        "paradigm": "Last changed on\nTue September 7, 2021  at 3:44 PM PDT\n\n\nI'm a lay judge please adapt.\n\n",
        "rating": "Lay"
    },
    {
        "name": "Riley  Fisher",
        "school": "Hire",
        "paradigm": "8 rounds\n\n\n\n\n\n\n\n\n\n\n\nLast changed on\nMon August 16, 2021  at 5:45 PM PDT\n\n\nI am a college student at uchicago. I did both speech and debate in high school, but mostly competed in public forum.\nI am a flow judge but I still want you to take the time to explain your cards and ultimately why you're winning. Hearing your own words is so much more persuasive to me than listing off cards. You definitely don't have to talk slow but, if you're speed is preventing you from enunciating or completing sentences, I don't want it. PLEASE don't argue with me post-round unless an NSDA rule was broken/card issue/etc.\nQuality &gt; Quantity ; tech &gt; truth\nIf your competitor is lying or overreaching, say something or I'll assume that you're fine with it and flow accordingly.\nDO NOT BE RUDE TO YOUR OPPONENTS. If you choose to be rude/condescending/etc to an opponent, I will at best give a horrible speaker score and at worst vote against regardless of my flow.\nSignposting is nice for me to keep up, but not necessary. In PF, if you drop frameworks or don't use them correctly then I will default cost-benefit. But I really like framework debates :)) In LD, you need to have a value and value criterion.\nIf you don't know technical terms/debate vocabulary, I won't think you're dumb for asking the other team to clarify or if you don't use any. It's more about the content of your evidence and lines of reasoning.\nAlways remember (for my judging):\n- if you don't say it in a speech, I drop it. You don't have to frontline if you're speaking first though, that's fine to bring up later as long as it's not a new argument ofc\n- don't tell me to extend things that have clearly been lost\n- links are KEY to winning arguments. spouting off big numbers is not as persuasive to me as a concrete link to a potentially smaller impact\n- Impact calc &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; tell me WHY you have the best impacts!\n\n",
        "rating": "Tech"
    },
    {
        "name": "Aric  Floyd",
        "school": "The Harker School",
        "paradigm": "Last changed on\nSat January 9, 2021  at 2:14 AM PDT\n\n\nPlease contact me any time, including before or after our round, with any questions or comments: aricf@staff.harker.org.\nAbove all else: Treat the round as an educational experience, and your fellow participants as you would like to be treated. This means being reasonably kind in general, but also ethical within the debate. I may intervene, even when not asked to by the opposing team, if a competitor:\n○ fabricates evidence, including disingenuous paraphrasing, or\n○ employs hateful language, or\n○ is disrespectful vis-à-vis trigger warnings for unexpected arguments (either neglecting to give one or, more rare, asks that a potentially-triggering argument is avoided as an act of strategy rather than legitimate self-care).\nBackground\n○ PF and LD in high school (2011–2014), both events on the national as well as local circuits\n○ Coached PF at the Champion Briefs Institute (now part of ISD)\n○ Now an Assistant PF Coach at The Harker School.\nThe upshot: I have been in a lot of debate rounds, so I am comfortable with debate-specific jargon and can flow at most speeds (I will call \"clear\" if needed). Please know, though, that clarity can be a factor in speaker points.\nSign-posting is especially appreciated, as I keep a detailed flow and base my decision on it.\nWinning My Ballot\nMy preference is to do as little work as possible, so tell me what to do: clear weighing of well-linked impacts within a well-established framework will go a long way. Try to anticipate the places in the debate where I have to make a non-obvious decision; if you give me reasonable instructions on how to make that decision, and the other team does not, you are ahead. I am open to almost anything that is sufficiently justified within the round, though the farther you stray from the resolution, the more you are inviting me as a judge to insert my own subjective views on reasonableness.\nThings I wish I saw more of in PF:\n○ Contextualize your impacts against the alternative(s). If you have a link to a small percentage decrease in the chance of, say, a famine, your impact is not that voting for you saves 100% of the death toll of said famine.\n○ Be selective. For example, it's often not a great use of time to read turns and mitigation on the same argument. If the turn is strong, mitigation only hurts you, and if it's weak, why read it?\n○ Be comparative. If you read a card that says something is true, and your opponent reads a card that says it is false, you need to give me reasons to prefer your argument to theirs. Do not just repeat your argument and insist that it is true without engaging in the clash.\nLet's have fun!\n\n",
        "rating": "Tech"
    },
    {
        "name": "Kepa  Francisco",
        "school": "The Cambridge School",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Gabriel  Gangoso",
        "school": "Magnet Academy",
        "paradigm": "Last changed on\nTue August 31, 2021  at 11:29 AM PDT\n\n\nI debated for 3 years at Skyline High School in Oakland, CA. Been coaching/judging on and off since 2014. Essentially, do what you want. Debate is a unique educational and competitive space, please make the most of it. I will vote on most things if you give me a good enough reason. I do not lean towards traditional or K/performative debate. Both are good and valuable. Again, do what you want. Have fun. Be nice to each other.\nGo ahead and add me to whatever email chain: gabriel.gangoso@gmail.com\nFlex prep is fine. In's and Out's are fine. Any other practices like this are probably fine.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Brian  Gao",
        "school": "The Golden State Academy",
        "paradigm": "Last changed on\nTue October 5, 2021  at 11:48 AM EDT\n\n\nHi guys! My name is Brian Gao (don't call me judge), and I'm a freshman finance bro at NYU Stern. I did three years of PF and one year of LD, so I am relatively familiar with debate jargon and have experience with both events. That being said, I have not debated in a while, so no theory and nothing too technical. Everything else goes. I will vote off the flow.\nPlease speak clearly! Speed (to a certain extent) is okay, but also remember that I probably have no background on whatever topic you guys are debating, so don't expect me to pick up on everything you're saying (i.e. acronyms or topic-specific phrases) if you aren't going to explain them to me beforehand. Please signpost!\nI was the self-proclaimed king of card dumping, but that being said, I also hated anybody who card dumped against me. I think it's okay if you do it, but please give some explanation before you give me another author's name and the year the card was published. If you're reading them as a group of responses, explanation at the end is also okay. Make sure to warrant your arguments as well.\nI was also the self-proclaimed king of never frontlining in second rebuttal and having my partner pick up the slack in summary. I don't encourage you to do that because I got called out for it a lot (still managed to win a good amount of rounds though), and it will be pretty inconsequential if your opponents can't really impact out their turns.\nTruth &gt; Tech - don't give me some BS argument and expect me to buy it. If you think you're giving me an argument that's a bit out there, you better have some pretty good warranting behind it. You're not going to impress me with the fancy stuff you learned at debate camp because a) it's not fair to your opponents that didn't go b) I probably won't understand it and c) you sound pretentious.\nMy biggest pet peeve is miscut evidence, so if you think your opponents have some shady stuff, please call it out for me, and I will review it at the end of the round. If your evidence is miscut, I will drop you depending on the severity, and your speaker points will suffer. You also might get a frowny face on your RFD :(\nLD Section: Everything written above applies. I enjoy util debates with good weighing that don't focus on unlikely impacts. Don't give me an argument like how writing this paradigm leads to extinction. Don't get too caught up in the value debate either - I'd much rather hear the substance of your arguments.\nNow the fun part! I think debate gets taken a bit too seriously sometimes, so I will appreciate any humor that you can give in cases/cross/rebuttals. Clever introductions and taglines are encouraged! You will not win the round just by making me laugh, but I'll add some speaker points. If you wear any exotic clothing (I wore watermelon socks to every tournament), I will also be less critical with speaker points. Finally, I will also not complain if you cater the round once it is safe to do so.\nI never took debate too seriously but still managed to do pretty well. I understand that you guys want to win, but please enjoy the moment. Your four years of high school and high school debating careers will be over before you know it, so live in the present. My favorite memory from debate is eating Fruit Loops out of the highly coveted bowl that my partner and I won at Harvard! I feel like I sound like an old man typing this, but I promise that you will feel the same way in a couple years.\nIf you're looking for some low-quality entertainment in between your rounds, my TikTok is @briangao59. The videos that I am proudest of are of me imitating a seagull and imitating Addison Rae. If you scroll down a little more, you'll find a video of me with a buzz cut playing the piano that I'm also quite fond of.\nHugs and kisses,\nBrian\n\n",
        "rating": "Tech"
    },
    {
        "name": "Samuel  Georgecink",
        "school": "Delbarton School",
        "paradigm": "Last changed on\nTue October 5, 2021  at 9:39 AM EDT\n\n\nHey, my name is Sam! I debated on the GA circuit for 3 years and nationally for 2 (2014-2017), finishing my senior year at ToC and Nationals. Since then, I have judged and coached for several programs. Weigh your arguments and their terminal impacts against your opponent's arguments and impacts in summary/final focus. Second-half cohesion is important, make sure the summary and final focus work well together. I will not vote off of anything that fails to be extended from speech-to-speech. I can follow most speeds you're used to, but please do your best to speak clearly. Be polite to each other and enjoy the learning experience: DBAA!\n\n",
        "rating": "Tech"
    },
    {
        "name": "Rohit  Ghoshal",
        "school": "Archbishop Mitty",
        "paradigm": "Last changed on\nMon September 13, 2021  at 1:05 AM PDT\n\n\nArchbishop Mitty 18\nBrandeis 22\nDid pf for 4 years and a little bit of circuit ld\n2008 Beijing gold medalist in Public Forum\ncontact my manager at rghoshal@brandeis.edu for any business inquiries\nTournaments are stressful, if you need to take a quick break and look at pictures of cute animals or something I will not hold it against you if you come late to round by a few minutes.\nif you hit me up for flows of teams I have judged I will give general taglines but probably no more unless its some sketch stuff.\nPreferences:\n1. You and your partner must be astrologically compatible. My aura will detect if this isn’t the case and I will drop you.\n2. If you incorporate Minecraft or League of legends into your speech/background ill bump up your speaks by 1.\n3. If someone uses a framework in their constructive and never brings it up again I will bring out a nerf gun and shoot my camera multiple times.\n4. If you do not weigh, I will base the round off of whether or not your vibes are right.\nActual preferences:\n1. Don't go fast unless both teams are fine with it (same for K’s/Theory, this is pf).\n2. I lean towards wanting second rebuttal to cover your side of the flow, but at the end of the day I won’t drop your case for not doing it.\n3. First summary doesn't need to extend defense that is not responded to unless its also offense (turns).\n4. Try to pause for a quick second after saying a tagline, a lot of teams go straight from a tag to a card and I sometimes will miss card authors or other important info if u do that.\n5. Earlier u collapse the better, preferably in summary.\n6. I like good evidence ethics, if both teams are down I am fine with making it so when both teams are looking at evidence it doesn't count towards prep time. That being said if the tournament is running late try not to spend too much time looking at stuff.\n7. P L E A S E use cx educationally, I will not be flowing so use it to actually learn about how your opponents case works rather than trying to poke holes in it for the sake of looking good and making cross really boring.\n8. I don't care if you tactically drop stuff, if u literally delink your entire case but extend turns ill vote for u. In fact you should probably not be going for everything and should be dropping some stuff, but then again I come from a time of 2 minute summaries so idk how stuffs changed.\n9. I may call for evidence after round if its important and has been contested, this is online so idk if there's an email chain throw me on it\n10. If u do not weigh I will assume you are calling me fat and be sad\n11. Reread number 10\nask any other questions you have. This includes in the middle of the round I would rather you ask late than just guess what my preferences are.\nhere's a dope card: https://docs.google.com/document/d/1tCRQEPeJfypLTmdu3o4YX7YqmXoHrznLgT9g96Jcxqw/edit#heading=h.5t60pvwizdrn\n\n",
        "rating": "Tech"
    },
    {
        "name": "Mike  Girouard",
        "school": "Pu Tai Junior High",
        "paradigm": "Last changed on\nWed October 14, 2020  at 7:49 PM CDT\n\n\nMike Girouard\nYears involved in debate: 20+ (policy 20+years, PF 7yrs, LD 7yrs)\nCoached at Baylor, Kansas State, U of Rochester, The New School, Augustana College, The Asian Debate League and several High Schools - Debated at Univ of North Texas\nI hate people who try to pigeon-hole judges into fitting a particular mold or label them as hacks that only vote for certain args or certain types of arguments.  That being said I would say that I feel as though I can judge and evaluate any kind of debate that you want to have.  I have some feeling about args and I will discuss those more in detail below, but it’s important to keep in mind that when you debate in front of me you should be comfortable in yourself and your arg and you should be fine.  Have the debate that you want to have, because in the end that will make it more enjoyable and educational for everyone involved. \nOne last caveat, as this year has progressed and with the transition to paperless debate I find myself calling for less and less evidence after the round.  I feel as though you should be doing the debating in the round.  If it is a question of what the card says or doesn’t say I will probably call for the evidence, but don’t expect me to piece together your argument by reading all of your evidence after the round.  I feel as though this does a disservice to a team that is at least attempting to do the argumentation on the line-by-line. \nPrep Time – my default is that prep time should stop when the other team is flashing their evid.  That being said if there is blatant disregard for this or abusing of this I will revert to prep-time not ending till after the speech has been flashed and given to the opponents.  Before this does occur I will say something in the round.\nCP’s – I love a good PIC.  I think it should be the burden of the Aff to defend every aspect of the plan and should have some defense of including it in the plan.  I really don’t like to vote on theory, but I will if that is what you want the debate to be about.  As far as perms go, use them as you like.  Just justify your theory and your fine.  If you are going for a CP in front of me keep a few things in mind: it must have a net benefit and some sort of DA to the perm, it doesn’t necessarily have to solve for all of the Aff, but you need to have something to answer the portions that you don’t solve for, you can have a critical net benefit if you like, just explain how it functions in relationship to the Aff and the advocacy of the CP.   \nDA’s – Not really a whole lot to say here.  I like U cards to have some sort of a warrant.  Debate the warrants in the round and don’t make me have to evaluate 15+ U cards to help settle that debate.   I would prefer fewer cards with more warrants to help settle this problem.  Make sure you are giving me some sort of impact calc in the last few speeches and weighing all the potential outcomes of the impacts (i.e. – even, if statements).  If the aff reads a K of your impacts you have to justify them or you will probably lose that argument.  I prefer scenarios with fewer and more warranted internal links as to avoid the proliferation of outlandish impact scenarios.  Make sure there is a solid link and you are weighing everything in the last few speeches and you should be fine.\nThe K – I am open to most K’s.  I don’t believe that Realism/Framework is the end all answer to the K.  Try engaging in the arguments that are being run and you have a better chance of picking up the ballot in front of me.  Arguments that question your representations or epistemological starting point are best answered by providing an offensive justification for your reps or your starting point.  Just make sure you are explaining how you want me to evaluate your K in relationship to the Aff. What are the impacts, what are the implications, do you have an alt, and what is the link.  Make sure all of these things are in the debate and you will be fine.  I do find that most people don’t answer one fundamental question in these types of rounds: What is the role of the critic?  Just answer or at least recognize that these questions exist and you should be alright.\nTopicality – My default is that this debate should be about competing interpretations.  You should attempt to answer the question: which interpretation is better for both this debate round and the community as a whole.  This being said, if you don’t want me to evaluate it based on competing interpretations just make the arg and justify it with warranted args and you should be fine.  If you are going for T in front of me you probably need to spend a little bit of time on it in the 2NR.  I’m not saying that you have to go for T and nothing else, but I think it’s an arg that requires a little bit of time for you to adequately go for it.  Things I look for in a T debate: Clear distinction between interpretations, warranted reasons for why your interp is better as well as why the other interp is bad, and the impact these have on not only the round but the community at large.     \nTheory – Not a big theory hack, but will vote on it from time to time, especially in instances of clear articulated in round abuse.  Just make sure you are giving warranted reasons why your theory is legit, the specific abuse that has occurred and the impact of them being allowed to do what they did.  That being said, theory should be more than just a whine, engage their args and make sure that you are at least answering their args.  If you expect for me to vote on theory you should devote some time to it in the last couple of speeches.\nPerformance – I’m fine with different styles of debate.  There are instances where you can ask me to not flow or be so “flogo-centric” and assuming there is a warranted reason why this is legit I will be alright.  A few things to keep in mind if you do chose to do this in front of me: why is your method better than what exists now? why should it be preferred and what are the larger implications on the debate community?  Just make sure you are attempting to at least perceptually engage the other teams args and you will be fine. \n\n",
        "rating": "Tech"
    },
    {
        "name": "Eli  Glickman",
        "school": "College Prep",
        "paradigm": "Last changed on\nThu September 2, 2021  at 2:44 PM EDT\n\n\nI debated for two years for Bethesda-Chevy Chase HS. I'm now a freshman at UC Berkeley and a coach for College Prep. In my senior year I won Glenbrooks, the Strake Round Robin, Blake, Durham, the Barkley Forum, Stanford, Harvard, the King Round Robin, and NDCAs.\nAdd me to the email chain elglickman04@gmail.com. Please label email chains properly. Ex. \"TOC R1 F1 Email Chain Bethesda-Chevy Chase GT v. AandM Consolidated DS.\"\n\nTL;DR\nTabula rasa judge. Weigh, give me good warranting, and speak as fast as you want. Defense is sticky; first FF may read some new weighing (NOT elaborate weighing… no overviews, prereq analysis, etc.). Extend your arguments with card names, warrants, links, and impacts in the back half. Weigh links and turns, defense, and pretty much everything else. Please read the evidence section of my paradigm and abide by those rules, they will be enforced.\nDEBATE IS A GAME, PLAY TO WIN.\nTech&gt;truth. I will vote for pretty much any argument as long as it's warranted well and it's not racist, antisemitic, sexist, homophobic, etc. I have experience with traditional and progressive. I will vote on the flow.\n\nHow I Judge:\nIf my paradigm is unclear, my favorite judges were Will Sjostrom, Chad Meadows and Marcus Ellinas; anything PF-specific in their paradigms should give you a fairly good idea of how I hope to evaluate the round.\n———PART I: SPEECHES———\nSignposting:\nThis is essential; do it.\nCross:\nI might listen but I won't vote off or remember anything said here unless it's in a speech. Don't be rude. Feel free to skip GCX if everyone agrees—both teams get 1min of prep.\nRebuttal:\nRead as much offense/DAs as you want, just please implicate them on the line-by-line and weigh them. Second rebuttal MUST frontline terminal defense and turns, probably some defense too, but blippy NLs from the first rebuttal don't all need to be answered here.\nSummary:\nFirst summary only needs to extend turns but should also extend terminal defense if you have time. Defense is sticky, however, I’d prefer for the second summary to extend as much defense as possible. The only new turns or defense I’ll evaluate in summary are as responsive to new implications made by the other team.\nFinal Focus:\nFirst final can do new weighing but no new implications of turns, or anything else UNLESS responding to new implications or turns from the second summary. Second final cannot do new weighing or new implications. Final focus is a really good time to slow down, treat me like a flay judge in these speeches and my decision becomes a lot easier.\n———PART II: TECHNICAL STUFF———\nDO NOT SAY 'DELINK,' SAY 'NO LINK.'\nVoting:\nI default to util. If there's no offense I presume to the first speaking team. I will always disclose after the round, whether the tournament permits it or not. I can also disclose speaks if you ask.\nEvidence:\n—Evidence §1—\nI will not accept paraphrased evidence. I treat paraphrased cards as equal in link strength to analytics. (You can make a theory argument as to why I shouldn't). If there are two pieces of competing evidence that will determine the round and both teams want me to look at it... I will almost always err on the side of the non-paraphrased evidence. Whether or not you paraphrase, YOU MUST have cut cards, if you don't I will cap your speaks at 27 and you should strike me (27 speaks cap does not apply for MSPF, NPF or JVPF).\n—Evidence §2—\nWhen evidence is called for, take less than 2 minutes to pull up the cards or it comes out of your prep.\n—Evidence §3—\nIf you misconstrue evidence—you know who you are—and I find out, I will either drop you or give you the lowest possible speaks, depending on the severity of the misconstruction (I am more than willing to assign an L20 or below). If you catch your opponents misconstruing evidence, call it an independent voting issue (IVI) and I will treat this as a pre-fiat round-ending argument if the evidence is sufficiently misconstrued.\nEmail Chains:\nPlease label email chains adequately. Ex. \"TOC R1 F1 Email Chain Bethesda-Chevy Chase GT v. AandM Consolidated DS.\"\nWhether or not the tournament is online I will require an email chain for every round, evidence exchange is faster and more efficient. If you are spreading or reading any progressive argument you must send a doc before you begin; otherwise, sending a doc will not be required. If you choose to send a speech doc with cut cards before the given speech begins, I'll start your speaks at a 29 and won't go below that.\nPrep Time:\nDon't steal prep or I will steal your speaks. Feel free to take prep whenever, flex prep is fine too.\nSpeech Times:\nThese are non-negotiable. I stop flowing after the time ends, and I reserve the right to scream \"TIME\" if you begin to go over. Cross ends at 3 minutes sharp, if you’re in the middle of a sentence, finish it quickly.\nSpeed:\nI can follow speed (300wpm+) but be clear, if I can't understand what you're saying that means I can't flow it. I'd like a speech doc if you're going to go over 275 words per minute. Speed is good in the first half and bad in the second half, collapse strategically; don't go for everything. If you spread (300+ wpm) paraphrased cards there is no way you get above 27 speaks. If I miss something in summary or final focus because you're going too fast and I drop you it's your fault... slow down, don't go for everything, be efficient.\nDisclosure:\nIf you've disclosed on the NDCA PF wiki properly I will give you +0.5 speaks, there's no punishment for not disclosing. Let me know if you are disclosed before the round so I can boost your speaks. (How to disclose.) Disclosure should include round reports and open source documents (I believe that disclosing highlights is bad, I will not increase speaks or look more favorably on highlights having been disclosed).\nSpeaks:\nClarity and strategy determine your speaks. I disclose speaks as well, just ask.\nGood Star Wars references will result in higher speaks; the better the reference, the higher your speaks.\nPostrounding:\nPostround as hard as you want, I think it's educational. Before you start make sure I've submitted your speaks.\nTrigger Warnings:\nI do not require trigger warnings (I tend to agree with the vast quantity of scholarship that establishes that they increase anxiety, and are harmful for the antifragile human psyche) nor will I reward or penalize the use or absence of them. I am open to trigger warning good theory arguments, however, I will under no circumstances hack for these types of arguments. Thus I am also open to trigger warning bad theory arguments.\n———PART III: PROGRESSIVE DEBATE———\nI enjoy theory debate; I run theory frequently. You do not need to ask your opponent if they are comfortable with theory; 'I don't know how to respond' is not a sufficient response. To quote my partner Roy Tiefer, \"don't put your kids in varsity if they cannot handle varsity arguments\" (saying that is terminal defense against any 'idk how to respond' argument and will result in a 30 for whoever says it).\nPreferences:\nTheory/T - 1\nLARP - 1\nKritik - 3\nHigh Theory - 4\nNon-T Kritik - 5 (Strike)\nPerformance - 5 (Strike)\nTricks - 5 (Strike)\nTheory:\nYes, I think paraphrasing is bad and disclosure is good. No, I will not hack for either of these shells.\nI really like theory. I think frivolous theory is bad but I'll evaluate it; I have a lower threshold for responses the more frivolous the shell. Poorly executed theory will result in low speaks. If you've never run theory before, and feel inclined to do so, I'm happy to give comments and help as much as I can.\nI default to competing interps and no RVIs. I believe that winning no RVIs applies to the entire theory layer unless your warrants are specific to a shell, C/I, etc. Non-friv theory should be a zero risk issue to check abuse, I will still vote for RVIs if you win them.\nUnless I am evaluating the theory debate on reasonability you must read a counterinterp... if you do not all of your responses are inherently defensive because your opponents are the only team providing me with a 'good' model of debate.\nTheory should be read immediately after the violation. Eg. if you're speaking first disclosure must be in your constructive for me to evaluate it. However, I am willing to vote off of paraphrasing theory read after rebuttal if your interpretation is that people shouldn't paraphrase in rebuttal. You MUST need to extend your own shell in rebuttal if it was read in 1st constructive; you must frontline your opponent's shell in the speech after it was read (unless there is a theoretical justification for not doing this).\nKritiks:\nI have run Ks a few times, however, I am not the best K judge rounds. I'm more familiar with security, cap, and imperialism than anything else. You can run high theory Ks just explain them well, I'm fairly familiar with Foucault, Agamben, and Baudrillard.\nTricks:\nThese are pretty stupid but go for them if you want to.\nEverything Else:\nFramework, soft-left Ks, and DAs are fine. I've never run a CP, I don't really know how to evaluate that; you probably shouldn't do that in PF...but...if you want to...give me a really good reason why it's true or why I should evaluate it.\nTKO:\nIf your opponent has no path to the ballot (conceded theory shell or them reading a counterinterp that they do not meet themselves) invoke a TKO and you win with 30 speaks (unless you have violated any previous clauses related to speaker points), if they did have a path to the ballot you lose with 21s.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Geetika  Goel",
        "school": "Lynbrook HS",
        "paradigm": "Last changed on\nMon October 5, 2020  at 5:28 AM PDT\n\n\nPARADIGM WRITTEN BY SON:\nI am a (f)lay judge and have been judging for 4 years, please go slow and articulate well but that doesn't mean ignore the flow. No theory or K's. I am truth&gt;tech. I approach the round without my biases but won't vote off very farfetched/squirrely args even if they are conceded. I probably won't vote for you because of a turn/DA either. UNLESS THEY ARE VERY EXPLICITLY WON AND WEIGHED AND COLLAPSED ON. I vote off impacts, weighing doesn't matter to me if you don't win the link. Be respectful in cross, speaking style dictates speaker points.\n\n",
        "rating": "Lay"
    },
    {
        "name": "Malathi  Gopalan",
        "school": "Notre Dame San Jose",
        "paradigm": "Last changed on\nFri February 5, 2021  at 8:53 AM PDT\n\n\nI am a parent judge and been doing this since 2020. I am convinced with the team that delivers the speech with clarity and logic. I would like the debaters to be respectful, speak slowly and explain your arguments clearly to win the round.\nHave fun and enjoy debate!\n\n",
        "rating": "Lay"
    },
    {
        "name": "Angela  Gupta",
        "school": "University High School",
        "paradigm": "Last changed on\nMon December 31, 2018  at 10:23 AM PDT\n\n\nHello debate enthusiasts,\nI am a parent judge who enjoys watching public forum debate. For the benefit of the community, I would like to use this passion and turn it into service as a debate judge.\nRegarding speaking preferences, clarity is very important to me. I dislike spreading and prefer a more moderate pace.\nAlso, I value thoughtful and insightful debates with emphasis on impacts and command over topic literature. Make sure you effectively extend your claims in summary and crystalize your impacts in final focus.\nIn my book of judging, logic is as important as evidence.\nWishing good luck to all the competitors at the tournament!\n\n",
        "rating": "Lay"
    },
    {
        "name": "Muralicharan  Gurumoorthy",
        "school": "Foothill High School",
        "paradigm": "Last changed on\nWed January 6, 2021  at 3:45 PM EDT\n\n\nI am a first time parent judge.\nPlease speak slowly and clearly.\nPlease respect other speakers during crossfire and do not interrupt opponents.\nDon't read any progressive arguments.\nGood Luck!\n\n",
        "rating": "Lay"
    },
    {
        "name": "Cindy  Gutierrez",
        "school": "Hire",
        "paradigm": "8 rounds\n\n\n\n\n\n\n\n\n\n\n\nLast changed on\nThu September 16, 2021  at 1:48 PM PDT\n\n\n-All claims should have a clear link to evidence or precedent. If you’re going to tell me that UBI leads to nuclear war, you need to have some incredibly strong evidence. -Don’t be rude to your opponent. We debate because we enjoy it, don’t ruin that for someone. -I do not like spreading. I believe it makes debate incredibly inaccessible for many people who are not neurotypical. I understand that some forms of debate require it, so if you spread, make sure you are still saying words. If I have your case and can not even track your arguments while reading them, that is too fast. I will say clear if that is the case.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Benjamin  Hagwood",
        "school": "BL Debate",
        "paradigm": "Last changed on\nFri February 26, 2021  at 4:28 AM PDT\n\n\nBenjamin Hagwood, Head Coach at BL Debate Academy/Executive Director of NSDA Vancouver\nAbout me:\nI debated for five years at Liberty University. This will be my third year judging. Since trading places (debater to judge) my view of debate has matured and my perspective has become more open to views that I currently did not have. To begin I will say that I understand that debate is a game, with that being said I realize that some people use it as a place to protest, advocate and discuss their political, social, religious and individual ideas. I used my time as a debater to stretch the rules and practices of an activity that I viewed as net –beneficial to the growth of academics and potentially policy-makers. As a critic I enter a round with my predispositions just like everyone else but I don’t want to limit the discussion that can take place in any round.\nPublic Forum:\n1. You have a limited amount of time use it wisely. Collapse the debate down to the voting issues you believe you are winning.\n2. Offense is more important than defense.\n3. Weigh the debate accordingly.\n4. I don't flow cross fire but I do pay attention and if you say it then I count it towards how I will interpret your argument.\n5. If no framework is mentioned I will default to Util.\n6. I will base my decision based on sound logic and drops on the flow.\n7. Don't steal prep time.\n8. Don't be rude.\n9. Speaker Points: (ways to gain and lose them janks)\na. A tasteful bowtie will definitely increase your overall speaker points. (Max .5 increase)\nb. A joke that is actually funny will also increase your speaker points. (Max .5 increase)\nc. Bad jokes (Max 1.0 decrease)\nd. Offensive language or actions (Max 30.0 decrease)\nI am rather easy to talk to if you have any questions. Have fun and be smart when you think of your strategy. Do what you do and I shall tell you if I love it or not.\nPolicy\nThe stuff you need to read: (do you pref me or not)\n1. I think everything in debate is debate-able. I tend to enter the debate believing that I will vote for the team that persuades me that their argument is the superior to their opponents. I will say that I am not amused by offensive language or jokes (you should call people out on what they do though). So if someone does something that I think is offensive and you don’t call them out on it they could potentially still win the round if you don’t say something they will just also have a 0.\n2. Not reading a plan text doesn’t necessarily equal a loss in my book. I think great discussions can emerge from different ideas or strategies. This however does not mean that there is no way I would vote against you. If you are reading an argument that magically seems to shift out of every link in the debate that’s probably bad (again that is up for debate, also I think there is a large difference between not having a link and only having bad links).\n3. I absolutely love DA and case debates. I tend to believe that people don’t have good defenses of their case anymore because they just believe that no one argues inherency or solvency anymore, just CP’s and K’s. I think a formidable strategy is to completely deconstruct a case and go with a simple DA.\n4. I think critical theory is interesting. I have to admit graduate school stretched the theory that I would generally read but it has introduced me to new arguments and helped me grow. But my base knowledge is still critical race theory. This is generally my area of interest but I am definitely interested and reading other forms of critical theory. I will admit Baudrillard is still collecting dust on my “electronic” bookshelf. I intend to start reading more of if soon but so far I have only dabbled in his theories.\n5. I think that a well-placed theory violation can change the entire direction of a debate. I think that you can do whatever you want but you probably should be able to justify doing it. Being negative is not enough to be able to run four conditional positions that contradict each other. Those worlds are not hermeneutically sealed…sorry. Actually I am not sorry just don’t run bad strategies.\n6. Performance debate is growing and here to stay. That is not to say that you are not making important points, it’s just that generally (and most people won’t admit this) judging a team that executes a good performance is tough because you generally want to watch and enjoy and then remember that you also have to evaluate. Needless to say I am a fan of performance, but only if you do it well. Bad performances…please don’t do it in front of me.\n7. Clash of civilization – I haven’t actually judged many of these. I don’t know if I will or not in the future. I will say that if done well I think that framework can be a great strategy against a lot of teams. My particular opinion is that there is probably a better option to run against most teams (that don’t defend tradition notions of debate) but if that’s what you want to roll with then that’s what you should roll with.\n8. CP’s do it.\n9. Speaker Points: (ways to gain and lose them janks)\na. A tasteful bowtie will definitely increase your overall speaker points. (Max .5 increase)\nb. A joke that is actually funny will also increase your speaker points. (Max .5 increase)\nc. Bad jokes (Max 1.0 decrease)\nd. Offensive language or actions (Max 30.0 decrease)\nI am rather easy to talk to if you have any questions. Have fun and be smart when you think of your strategy. Do what you do and I shall tell you if I love it or not.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Alyson  Hamel",
        "school": "Flintridge Preparatory",
        "paradigm": "Last changed on\nThu October 15, 2020  at 6:19 AM PDT\n\n\nPlease speak clearly and not too fast. \n\n",
        "rating": "Tech"
    },
    {
        "name": "Michael  Harris",
        "school": "Lynbrook HS",
        "paradigm": "Last changed on\nFri April 16, 2021  at 1:44 AM PDT\n\n\nEmail: michaelgeorgeharris1@gmail.com\nLD Paradigm: I don't think I'm a good judge when the whole debate is a LARP debate (meaning when both debaters agree that the standard is util and then everyone just reads a bunch of cards) or for K debates where the tags and cards are littered with confusing jargon and the K debater isn't explaining any of it. In my opinion, I am pretty good at evaluating phil debates and theory debates.\nOther notes:\n1. Please pause between separate arguments, especially during rebuttals and when you're not reading off a doc.\n2. Don't assume I have heard your case/arguments before.\n3. In debates where the aff doesn't defend the topic and the neg reads T, I think the burden falls on the aff to explain why they didn't have to defend the topic.\n4. I will not vote on disclosure theory or any theory argument about something that did not happen during the debate. If the tournament you are at requires disclosure and your opponent did not disclose, that is something to let the tabroom know about, not me.\n*Let me know if you want a copy of my flow after the round, I'll send it in response to the email chain.\nPF Paradigm:\n1. Don't go for everything in final focus. Remember to both weigh your own arguments and also to respond to your opponents' weighing.\n2. The theory debates I see in PF are pretty sub-par to be honest, probably because it's still a relatively new trend. I'm probably not going to vote on arguments that seem blatantly against the spirit of Public Forum like 'paraphrasing bad.'\n3. If it takes you longer than a minute to send a card, I'm taking the remainder out of your prep time. An easy way to avoid any evidence exchange issues is simply to email your opponents a copy of the exact document you're reading from. Any evidence sent should include cites with links to the articles.\n4. I'm fine with skipping grand crossfire if both teams would like to do so -- in fact, that is what I would prefer.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Jack  Hayes",
        "school": "Hire",
        "paradigm": "Last changed on\nSat September 18, 2021  at 4:18 AM CDT\n\n\nEMAIL CHAIN: jhayes48@fordham.edu\nVista Ridge ‘21 | Fordham ‘25 | he/him\nHello! I competed in PF for Vista Ridge High School for two years, qualifying for TFA State twice (and breaking) as well as the TOC. I now attend Fordham University in New York. If you have any questions, don’t hesitate to ask me before the round.\nSafety:\n\n\nIt’s very important to me that you feel comfortable in the round. With that being said, a few things:\n\n\n\nBe kind to each other.\n\n\nI am not tolerant of any sexism, racism, or anything of derogatory nature and my ballot will reflect that.\n\n\nI am okay with theory as long as there is a legitimate violation/injustice in the round. I will not under any circumstance vote off of any other shells, including paraphrasing and disclosure. If you run theory, I expect you to go for it, otherwise it comes off to me as you trying to throw off your opponents (I will dock your speaks).\n\n\n\nGeneral:\n\n\nPlease develop a narrative that is easy for me to follow. It will be easier for me to actually buy your arguments.\n\n\nTech &gt; truth, but I still expect arguments to be fully extended and comparatively weighed. I am more tabula rasa than not. I will vote on the least mitigated link chain with a heavily weighed impact.\n\n\nPlease signpost and collapse.\n\n\nPlease do not yell during your speech. It does not make you go faster or make your arguments better; it only makes things uncomfortable and hard to watch.\n\n\nDon’t turn CX into a shouting match.\n\n\nKeep track of your own time.\n\n\nExpect speaks around 28.5-30 unless you are rude or don’t play fairly.\n\n\nRebuttal:\n\n\nSecond rebuttal must frontline the first rebuttal.\n\n\nI am not a fan of “card dumping.” I’d rather you have fewer responses with a proper implication as opposed to a bunch of random responses that serve no purpose.\n\n\nSummary:\n\n\nDefense is NOT sticky.\n\n\nIf you extend an argument, I don’t want to hear “extend X” as that tells me nothing; I am not going to do the work for you. I want you to extend the warrant with an implication attached to it.\n\n\nCollapse as you see fit; don’t try to make every argument a voting issue.\n\n\nFully weigh your argument(s). Simply saying “we outweigh on X” is not enough for me to evaluate; tell me why you outweigh. “Strength of link” is not a real weighing mechanism.\n\n\nFinal Focus:\n\n\nAnything read in final focus must have been read during summary. I will not evaluate any arguments that were not extended in summary.\n\n\nThe majority of the speech should be devoted to weighing.\n\n\nMiscellaneous:\n\n\nPlease represent evidence honestly. I'm not going to punish you for paraphrasing but I do expect you to stay true to what the evidence is saying if you choose to do so. I will rarely call for evidence unless it sounds too good to be true. If you doubt a piece of evidence, tell me to call for it.\n\n\nOther paradigms I agree with: Amod Daherkar, Max Fuller, Mark Awadallah, Jonathan Daugherty\n\n\nCX/LD:\n\n\nI’ve competed in CX and LD some, but I’m not 100% on it so cut me some slack.\n\n\nPlease give me a speech doc so that I can follow.\n\n\nI’m not that experienced with progressive arguments; run them at your own risk. Consider me a traditional judge.\n\n\nCX is binding.\n\n\nCongress/IEs:\n\n\nJust please make yourself sound like you know what you’re talking about.\n\n\n\n",
        "rating": "Tech"
    },
    {
        "name": "Parag  Hegday",
        "school": "Canyon Crest Academy",
        "paradigm": "Last changed on\nWed December 4, 2019  at 10:39 AM PDT\n\n\nPlease be civil and courteous during the entire round, including cross-fire and rebuttals. I am fine with each of you keeping time, ok if you use your phone for the timer. Please have your cards ready to present within an appropriate amount of time so the rounds aren’t slowed down.\nI discourage spreading… I would much rather see a concise and analytical presentation rather than simply speeding through your material. You can run theory and kritiks but do not expect me to understand and evaluate them. Clear signposting and quantifiable impacts are important to me.\n27: Average Speaker\n28: Good Job!\n29: Very good speaker\n30: You wowed me\n\n",
        "rating": "Tech"
    },
    {
        "name": "Max  Hendrix",
        "school": "Loyola High School",
        "paradigm": "Last changed on\nTue June 15, 2021  at 3:19 AM PDT\n\n\nI'm a college student who did Public Forum throughout high school. I have experience with debates at all levels ranging from extremely lay to Nationals level competition.\nThe biggest things I look for are clash between cases and weighing arguments within that. It's your job to actively interact with the opposing teams arguments and then be able to tell me why your side is better. If you don't weigh in round, then I'll have to do it at the end and it may not be favorable to you. However, if you give me your own framework and/or weighing mechanism to evaluate the round, I will judge through that lens.\n\n",
        "rating": "Lay"
    },
    {
        "name": "Queena  Hoang",
        "school": "Hire",
        "paradigm": "8 rounds\n\n\n\nNone\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Teresa  Hu",
        "school": "Mission San Jose High School",
        "paradigm": "Last changed on\nSat May 15, 2021  at 9:19 AM PDT\n\n\nhey! im a lay judge -- just be sure to have fun &amp; im excited to see y'all debate!\n\n",
        "rating": "Lay"
    },
    {
        "name": "Rhyen  Hunt",
        "school": "La Salle College Preparatory",
        "paradigm": "Last changed on\nTue September 14, 2021  at 6:41 AM PDT\n\n\nI debated at La Salle College Prep in Public Forum on the National Circuit for all of my high school career, reaching outrounds at tournaments such as Berkeley and Yale and qualling to the TOC and Nationals twice. I am currently studying International Relations at Durham University in the UK. \nI would consider myself a flow judge(tech&gt;truth) I have a soft spot for theory(not frivolous) and K's however you still need to win the round to win my ballot. I am perfectly ok with spreading just let me know if you plan on it before the round. Here are some things you can do to win my ballot.\nGeneral Debate:\nConstructives can be anything, I don't ever take my own opinions of policy into a debate round, just do not be offensive\nFramework must be responded to in the following speech(ex. if someone reads structural violence framing in 1st constructive, propose an Alt framework or concede in 2nd constructive)I will evaluate and abide by the conceded/won framework very strictly\nRebuttals can do whatever, I evaluate offensive overviews coming from 2nd rebuttal, unless theory is read telling me why I shouldn't. I expect 2nd rebuttal to handle offense. If you do not frontline in 2nd rebuttal, its highly likely I wont vote for you.\nIf you do not weigh in summary, I will not vote for you because you did not tell me how to evaluate the round. Please do comparative weighing and meta-weighing if necessary (i.e. why scope is more important than timeframe). Absent weighing, I default to to the most terminal impact in the round aka lives.\nExtend the entirety of an argument. Have the whole story in there, don't assume parts of the argument even if they drop it. If they drop it, you can be quicker on the extensions that are predicated on concessions, but still do them (re-tell the warrants).\nBig Picture in Final is preferred, unless something has happened in the round that prevents you. If there is an offensive overview you can respond, aside from that nothing new\nTheory and K Debate: \nK's should have links to the consequences of the plan or a very very good alternative. I am most likely to vote for the kritik if the K explains why the link turns the aff and takes out solvency at some level.\nLinks of omission are not compelling and the alternative needs some solvency mechanism other than reject the affirmative, whether that be a policy option or to burn down the state. If I think that you are relying on buzzwords to explain the position, my understanding of your argument won't be very good.\nI am most familiar with Fem, Securitization, and Afropessimism however, I am read on most general K literature(militarization, orientalism, etc.) so read whatever you want in front of me\nI will evaluate any Theory, however, I strongly dislike Topicality theory against Identity based argumentation. Please read a ROB in the theory and if you are against the theory RVI!!\nSpeaks: \nI give higher speaks because I think they can be extremely biased against minorities.\nIf you want good speaks, be respectful, clear and follow my paradigm\nI will bump you .5 if you reference Star Wars or Harry Potter in your speech.\nIF YOU ARE SEXIST, RACIST, HOMOPHOBIC, TRANSPHOBIC, CLASSIST, I WILL DROP YOU AND CONTACT YOUR COACH. PLEASE MAKE DEBATE A SAFE PLACE. \n\n",
        "rating": "Tech"
    },
    {
        "name": "Adnan  Ismail",
        "school": "Fairmont Prep",
        "paradigm": "Last changed on\nSat September 18, 2021  at 8:10 PM +14\n\n\n********************************************************************************************\nI will give teams 1 extra speaker point per speaker if they properly use an email chain during the round. This means:\n-Case writeup with the cards used in case below should be sent in a word/google document (like this) BEFORE your first constructive speech\n-Any cards being planned on read after that should be sent in a word/google document (like this) right BEFORE it is read in speech.\nThis likely means you'll have to cut your cards BEFORE ROUND (I know, shocker!). Don't be spending 5 minutes cutting cards during the round to earn this point, you'll each lose half a point as a result if you do. Case docs should be ready to send the second you enter the call too\nEmail is adnan.m.ismail@berkeley.edu.\n***********************************************************************************************\nI'm a 4th year bioengineering student at UC Berkeley, and I've competed in PF for about 5 years in middle and high school.\nLets start with the obvious: DON'T BE RACIST TRANSPHOBIC HOMOPHOBIC SEXIST ABLEIST ELITIST OR EXCLUSIVE IN ANY WAY OR I WILL DROP YOU, GIVE YOU 0 SPEAKS, AND MAYBE MORE. \n-Warrants in everything are especially important to me, and it's really important your warrants are clear. Lack of clarity will make me confused, drop your speaks and most likely drop you the round.\n-Additionally, I look for the path of least resistance to the ballot. In other words, if you have an argument that's been clean dropped and you weigh that argument very well, 8/10 times I'm voting on that argument.\n-The best way to create a clear-cut path to the ballot and follow the first two bullet points is by collapsing well on good arguments, especially in the second half of the round. Collapsing creates a much more narrowed/focused round that is easier to judge and follow, and it allows you to nuance and explain your arguments more fully. The more in-depth analysis you do when collapsing/as a result of collapsing, the more likely I'll vote for you.\n-For the most part, anything that you say in final focus should be in summary. On the note of the second half of the round/frontlining in 2nd rebuttal or whatever,...I don't care. Just be consistent. Specifically:\n----If you frontline in 2nd rebuttal, it's gonna be hard for me to accept new frontlines in 2nd summary. I'll give more leeway for defense that's not frontlined in 2nd rebuttal but almost impossible for turns.\n----So long as the defense is untouched, first speaking teams can extend defense from first rebuttal to first final focus. But if the first speaking team extends defense in first summary, that defense is the only defense that can be extended into final focus. \n -You can start your weighing whenever, even in final focus. But BIG weighing mechanisms (like those overviews that outline a certain argument/impact as the most important in the round for example) should arrive before second rebuttal. On that note, weigh! It's good to get the ballot. Not just buzz words. But like, actual weighing. Answer questions like these in your weighing: \"How does your impact outweigh on magnitude?\"\n-Lastly on the note of the second half of the round, and I cannot stress this enough: YOU HAVE TO EXTEND EVERY PART OF THE ARGUMENT YOU WANT ME TO EVALUATE. THIS INCLUDES THE LINK, THE INTERNAL LINK(S), AND THE TERMINAL IMPACT OF YOUR ARGUMENT WITH THE WARRANTS FOR EACH PART OF THE ARGUMENT. NOTHING BLIPPY!!\n-Don't spread please. I'm good with a brisk pace of talking (If you're confused, err on the side of slightly slower instead of slightly faster).\n-I'm not extremely familiar with more technical argumentation (K's, theory, etc.). My philosophy is that while they look more \"spooky\" or \"cool\", all arguments share the same structure, where they require some sort of link, an explanation for why it matters (an impact) and warrants all throughout and in between. So just make sure to make the warranting for these arguments crystal clear.\n-On that note for theory, the bar for whether or not a team is abusive is quite high. So run at your own risk. If you do think that your theory shell is very warranted and the abuse is substantial and you want to win off of it, I should expect it to dominate your speech time in the second half of the round. As in your entire FF should be dedicated to the shell that you read. Also if you read theory, I'm more inclined to listen to a well hashed shell compared to \"paragraph theory.\" It's easier to flow and simply more clear for me. But I won't get angry at you if you read paragraph theory.\n-And lastly don't know much, if anything, about the topic, and definitely not familiar with the topic lit at all. So clarity in warrant/impact analysis and extension of arguments and whatnot is esp key to pick up my ballot this tournament.\nGood luck and have fun! Any questions email me at adnan.m.ismail@berkeley.edu\n\n",
        "rating": "Tech"
    },
    {
        "name": "Murali  Iyengar",
        "school": "Northwood High School",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Sameer  Jani",
        "school": "Potomac Debate Academy",
        "paradigm": "Last changed on\nSat September 18, 2021  at 5:02 PM EDT\n\n\nHi, I am a parent judge who has some experience judging. I would classify myself as a lay- judge. I have a vast understanding of this topic and I can understand different view points.\n-- I am looking for arguments that have a logical basis\n-- Please make sure that you understand your arguments and that you do not make arguments that you can't justify.\n-- I feel that debate is about bringing your logic to another level so if your argument is not clear or lacks logic, I will not vote for it.\n-- Please do not spread because it will result in you losing speaker points\n-- Please do not use debate jargon\n--Make sure to extend your arguments and impacts into summary and final focus or else I won't evaluate them.\n--Weighing is super important to me so make sure that you do it\n--Do not be rude to your opponents and make sure you give them a chance to speak.\nIf you have any specific questions, please ask me during the round! Good Luck to you all!\n\n",
        "rating": "Lay"
    },
    {
        "name": "Dhamodaran  Jayabalan",
        "school": "Dougherty Valley High School",
        "paradigm": "Last changed on\nFri September 10, 2021  at 11:45 PM PDT\n\n\nI am a judge in PF for Dougherty Valley High School.\nBasic Preferences:\n- Please do not speak fast, and try to be as clear as possible when you speak.\n- You should be telling me how I should be weighing the round.\n- Be polite to your opponent and be respectful.\nGood luck!\n\n",
        "rating": "Tech"
    },
    {
        "name": "Raj  Jayaraman",
        "school": "Lynbrook HS",
        "paradigm": "Last changed on\nFri February 5, 2021  at 12:13 PM PDT\n\n\nI am a new judge this year, please don't spread in your speeches and talk at a moderate pace. \nFollow these guidelines and you will be successful with me as a judge -\n1. The Most Obvious - Be Nice!\nBe nice to your opponents in round, and if you are rude in crossfire or speeches I will drop your speaker points.\n2. Please provide full cards\nWhen giving cards, please send the link to the website, the authors name and date, and the paragraph from the website. \n3. I am big on weighing\nPlease make sure to weigh your impacts to show why you are winning the round and tell me what you are weighing off of.\n\n4. Make sure to time yourself\nHappy debating!\n\n",
        "rating": "Tech"
    },
    {
        "name": "Saumya  Jhaveri",
        "school": "Ridgewood Independent",
        "paradigm": "Last changed on\nFri September 24, 2021  at 10:40 AM EDT\n\n\nbellaire '21 | rice '25\nEmail is: saumyajhaveri17@gmail.com\nPF:\nTech &gt; Truth\nDefense isn't sticky\nI don't like progressive arguments\nWon't call for evidence unless the team explicitly asks me too\nGood extensions are key, including a claim, warrant, and impact. \nComparative Weighing wins the round\n\nCongress:\n1. Sponsors are underrated, so there's a good chance I score them high.\n2. Argumentation is the most important thing in this event, so your speech needs to have a clear link story\n3. Use strong, passionate rhetoric smartly. Meaning, the whole speech shouldn't be full of metaphors and hyperbole.\n4. Please don't say \"right now, in the status quo.\" It's the same thing.\n5. Have fun, and find ways to make yourself stand out from the group.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Amanda  Johnson",
        "school": "Hire",
        "paradigm": "Last changed on\nThu February 4, 2021  at 1:30 AM CDT\n\n\nI prefer a resolution of debate issues in the round and speaking skills when I judge debate. Be organized.  Use structure and roadmaps.  In CX I fall under policy or stock issues when I am making decisions.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Sky  Juinio",
        "school": "The Nueva School",
        "paradigm": "Last changed on\nTue May 18, 2021  at 11:12 AM PDT\n\n\nhi! i'm sky.\nemail is spjuinio@gmail.com.\nplease have pre-flows done before the round for the sake of time. don't be late.\ntech over truth. i won't do work for you. your arguments should have explicit explanations and contextualization. tell me a thoughtful and thorough story with substance. even if you sound pretty, my ballot will ultimately go to those who did the better debating.\nread any argument you want, wear whatever you want, and be as assertive as you want. any speed is fine as long as you are clear. my job is to listen to you and assess your argumentation, not your presentation. i'm more than happy to evaluate anything you run, so do what you do best and own it!\ndo note that the only exception to this philosophy is if you make blatantly ignorant statements.\nrfds. i always try to give verbal rfds. if you have any questions regarding my feedback, feel free to ask. i also accept emails and other online messages.\nnow, specifics!\ntopicality. it would behoove you to tell me which arguments should be debated and why your interp best facilitates that discussion. if you go for framework, give me clear internal link explanations and consider having external impacts.\ntheory. make it purposeful. tell me what competing interps and reasonability mean. i like nuanced analyses; give me real links, real interps, and real-world scenarios that bad norms generate.\ncounter-plans. these can be fun. however, they should be legitimately competitive. give me a clear plan text and take clever perms seriously. comparative solvency is also preferred. impact calc is your friend.\ndisadvantages. crystallize! your uniqueness and links also matter.\nkritiques. i love these, a lot. i enjoy the intellectual potential that kritiques offer. show me that you are genuine by committing to the literature you read and provide an anomalous approach against the aff. judge instructions make my life easier and can win you the debate.\ncross. i'll listen, but i won't evaluate arguments made in crossfire unless you restate your points in a speech. use this time wisely.\nevidence. i'll read your evidence at the end of the round if you tell me to or if it sounds too good to be true. however, this isn't an excuse to be lazy. narrative coherence is very important to me.\npublic forum debaters should practice good partner coordination, especially during summary and final focus. arguments and evidence mentioned in final focus need to have been brought up in summary for me to evaluate it. please weigh, meta-weigh, and crystallize!\ntl;dr. show me where and why i should vote, thanks.\nyou are all smart. remember to relax and have fun!\n\n",
        "rating": "Tech"
    },
    {
        "name": "Margaret  Kalaw",
        "school": "Flintridge Sacred Heart Academy",
        "paradigm": "Last changed on\nSat September 18, 2021  at 2:02 AM PDT\n\n\nHi y'all! I debated PF with a good mix of district and circuit tournaments all 4 years of high school.\nessentials:\n- be fair &amp; respectful in and out of your rounds and stay within time limits of speeches and prep.  going about 10 seconds over in speeches is generally ok, but I'll stop flowing anything after that.\n- everything collapsed on during final focus should be extended through summary. give me a way to weigh the round; please don't leave me to decide how to evaluate everything. you also don't have to wait til summary/final focus to start weighing impacts!\n- in terms of frameworks, I'd prefer if you gave me one and actually used it throughout your round, but otherwise I'll default to cost-benefit analysis.\n- for me to buy an argument, you have to explicitly state your warranting and links, otherwise it's harder to access any impacts. doesn't hurt to extend warranting all the way to final focus.\npreferences:\n- PLEASE SIGNPOST! off-time roadmaps are also fine.\n- if you're the second team giving the rebuttal, you should frontline your case, though i'll still flow through frontlines brought up in summary. but it'll probably be harder to for everyone in the round to respond to it.\n- i think reading full cards can be a waste of time, paraphrasing is ok as long as you cite it. but don't just cite the card and expect me (or your opponent) to know what you're talking about.\n- i'm a fan of using frameworks to run creative arguments! using the framing actively during the round and to weigh impacts keeps debate interesting :)\n- most importantly, have fun!! debate is a such a cool and engaging activity and our primary reason for being here is to learn about these topics analytically and in depth.  \n\n",
        "rating": "Tech"
    },
    {
        "name": "Alexandra  Kallaher",
        "school": "DebateDrills",
        "paradigm": "Last changed on\nSat September 11, 2021  at 5:48 PM EDT\n\n\nShe/her\nBackground: 3x nats senate 1x toc congress, 1x toc info 2x nietoc various events, decent amount of experience in PF, I understand LD and progressive debate but I've never done it done it and so better to err on the side of caution if you are going to get funky, if I'm judging policy then we all better put our big brain hats and cross our fingers\nadd me: alexandrakallaher@gmail.com\nSome things to consider if I'm judging you no matter event + a note on online judging:\n1. Signpost. You could have the best refutation ever but if you don't signpost I might miss it.\n2. don't be rude, debate is supposed to be accessible and fun for everyone, so respect your opponents! Debaters who look like they're having a good time are way more fun to judge.\n3. If for some personal or act of god reason you need to step away from the computer please just say something. I will do my absolute best to accommodate you within timely reason.\n4. Speed isn't an issue for me but online there might be some lag problems so just know your wifi.\n5. I enjoy niche arguments in every event as long as they aren't unfairly specific\nSome things to consider if I'm judging you in Congressional Debate:\n1. Key word up there is debate. I highly value refutation in congress speeches. No worries if you give an authorship, but try to show me different facets of your argumentation skills and speaking styles. I'm judging on a holistic model of who is the best legislator in the round- not necessarily who has the best argument or speech.\n2. I'm not a fan of when no one is prepared to give speeches. If you get up to give a speech because there is a lull, even if you are not perfectly prepared, I will mentally award you brownie points and it will contribute to the \"best legislator\" notion.\n3. I do pay more attention to CX in congress than other debates because of how few times you get to speak. But it won't make or break you. That being said, if you ask the same question again and again to different speakers I will probably find you annoying and not contributing to the debate.\n4. I love crystallizations and later round speeches in congress. If you are giving the last speech do not give a constructive. Congress is about engagement and adaption. If you give a constructive 13 speeches in the debate I am going to wonder what you have been doing. The later the cycle goes the more weighing should be done.\n5. I value argument&gt;speaking 99% of the time. But, congress does have speaking elements to it. As long as you are loud and clear we should not have a problem. It is nice if you don't look at your flow pad too much.\nSome things to Consider I'm judging you in PF/LD:\n1. Voters. I will vote off of what you tell me to. If a team doesn't give me voters I default to the other teams. Be clear and do the work for me and I won't care \n2. Weigh\n3. I'm tech can be over truth but I do like hearing warrants and am responsive to teams calling out logical gaps/ inconsistencies in link chains\n4. If you want me to read a card than tell me to call for the card otherwise sry bud\n5. Don't flow cross so if something happens than you better bring it up in a speech\nA note on Theory and K's:\n1. Theory is necc. to keep debaters in check but I'm not a fan of tricks, time wasters or other trivial nonsense. Please explain it clearly like you are talking to your well educated but slightly demented grandma\n2. running theory just to be strategic kinda makes me queasy and I will have more leniency for your opponent if it's silly\n3. Running theory against clearly inexperienced debaters is a form of abuse in itself\n\n",
        "rating": "Tech"
    },
    {
        "name": "Edward  Kim",
        "school": "Flintridge Preparatory",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Leonard  Kim",
        "school": "BergenTech HS",
        "paradigm": "Last changed on\nTue September 14, 2021  at 5:20 AM EDT\n\n\nThis is my first time judging public forum debate and consider myself an amateur \"parent judge.\"\n- I flow the debate and make my decision mainly on the contentions you win on the basis of evidence, &amp; weighing in the Final Focus.\n- I judge on content, not delivery. I am comfortable with most speeds but don't go too fast.\n\n",
        "rating": "Lay"
    },
    {
        "name": "Steve  Kim",
        "school": "Potomac Debate Academy",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Jared  Koch",
        "school": "Hire",
        "paradigm": "8 rounds\n\n\n\n\n\n\n\n\n\n\n\nLast changed on\nSat September 18, 2021  at 11:06 AM EDT\n\n\nHello! Currently I am a community college student in something of an academic limbo who will soon, God (Catholic or otherwise, I’m open to letters of recommendation) willing, be transferring to UC Berkeley.\nI’ve debated for quite some time for the Mount San Jacinto Community College team but now I am something of a debate mercenary debating for College of the Canyons for whom I am the only member of the team.\nThis will be my first time filling out a judging paradigm form so please forgive me if it is somewhat unorganized.\nExperience\nSo, in regards to my personal debate experience I was a High School Parli debate and thus qualify as a debate veteran. I have competed in Parli and am well acquainted with both the types of arguments as well as the sort of meta \"culture\" I suppose surrounding this. What this means is that I will typically be familiar with most debate terminology and will not be suprised get a case of the vapors if you propose a K or run an abuse argument. However, that being said I do certainly have grievances with some form of debate, somewhat due to personal trauma being a debater with only a club to compete with and encounter suited barbarians who would constantly run K's and definitional arguments in a round. I will also mention that although I have started to judge it more, I am not someone who has competed in Policy debate nor Public Forum, and as such I would perhaps advise you to try to use terminology that isn't only in that format, or at the very least take a moment to explain it as assuming the judge knows your secret debate society language can occasionally make it difficult to judge you in round.\nJudging Style\nSo, I will firstly start out by saying that I am very much not a conventional judge in regards to some of my beliefs regarding judging during the round. I will take something resembling a flow, however I see rhetoric and narrative to be important aspects of a debate round that exists alongside the actual arguments themselves. I typically do not do a hard calculus of impacts and individual dropped arguments if they do not seem significant to me. I will also mention that I am willing to do slightly more labor on the judge's side than perhaps others. If you propose an argument but perhaps don't give an exact impact or connect to an the other team’s argument but I can see a connection, I will still consider it in that context but perhaps with not as much enthusiasm than if you explain to me why you argument about social media turning the Zoomer generation into zombie like drones of the state also relates to the opponents contension about twitter cancel culture being the next religious revival.\nIn regards to the question of whether the judge's perspective is brought into the round, I will admit that I very much believe that the judge is an actor within the round and that their knowledge does influence the round as well. What this means is that if you give an argument that is just blatantly false or not well supported, even within your speech, I will not treat it as though its logical rational truth within the round. I will still consider it and perhaps expect the other team to address it, but I will still have some standard myself as a judge. This doesn't mean I will attempt to be intentionally biased, however, just know that if I am judging you I am not going to just readily give you the win on any dropped argument or piece of evidence just because it wasn't fully addressed by the other team.\nI do appreciate organization and reading out the general themes of your argument. You don't have to lay it out in your first speech and I will generally arrange the argument myself in my notes, but it is something that certainly makes it much easier to judge you, and I know because I myself have horrifically difficult to follow debate organization at times, like, modern art living room arrangement style.\nSpread\nSo....this one is a bit difficult. I am quite used to following and partaking in speedier, more beefy rounds so in that regard I am not a lay judge. However, I am aware that in certain formats, particularly Public Forum and policy it is occasionally expected that the judge should be able to follow even if the debater is reading at a ridiculous speed attempting to cram in an entire list of arguments which, while I appreciate the enthusiasm, can make the round very difficult to judge in a manner that actually considers the arguments presented. In regards to speed, while I will allow you to speak quickly, please make sure you are actually emphasizing certain points and pronouncing your words and actually taking time to separate out your contensions. Also, in regards to accusations of spread, I am very much willing to take arguments in regards to this specific form of abuse, and I think that thinking you can win a round purely based on dropped arguments that are not even fully addressed by your team, or due to drowning the opponent in them is one of the more obnoxious tendencies of debate. I am fine with devious tactics and questionable frameworks if you can protect them, however this is something where I tend to find it a bit intentionally disruptive.\nKritques\nSo, Kritqiues….I guess I will start out by saying that I do quite appreciate these. They are like little warlock wizard spells that you can cast to hex your enemies or make them have to contend with being accused of “promoting an American individualist mindset” due to saying they think the Avengers movies provide great role models. I also think that Kritiques also sort of tie debate into the actual academic concerns that you may encounter at the college level, so I am very much in favor of them as a concept. You should still explain how it relates to the round, and present properly for debate by explaining why either supporting the resolution or the way in which the other team debating requires a consideration of the kritique. It can be difficult to achieve a win based on a Kritique alone, however if you feel it's powerful enough and want to make it the focus of your speech then I very much support that.\nAlso, I have been accused of being slightly Commie before...\n(Don't worry, I probably won't summon the CIA)\n\n\n\n",
        "rating": "Tech"
    },
    {
        "name": "Dominique  Kopko",
        "school": "Xaverian High School",
        "paradigm": "Last changed on\nWed May 26, 2021  at 3:52 PM EDT\n\n\nHi, my name is Dominique and I am an assistant coach at my HS alma mater, where I competed in congress, extemp, and OO.\nThat said, I have experience judging some debate at the local level, but I am more often judging speech. I am a flow judge to the best of my ability, but spreading is not in your best interest. It is likely better that you don’t run any high level theory in front of me: straightforward, well-warranted arguments with clear impacts, good clash in rebuttals, and ample weighing are your best path to victory, not convoluted theory and technicalities. Tech over truth won’t win me over. In PF, write my ballot for me in summary and final focus, clear voting issues and framing of the round are a must. In LD, clear brightlines in the value criterion are a must, and clear weighing in the rebuttals and delineating the lines of clash will be helpful in writing my ballot. If you go over your allotted time, I will stop writing and raise my hands. If I didn't write it down, It wont be judged.\nGood luck to everyone! You guys are awesome for choosing such a difficult categories and I have nothing but the utmost respect for all of you for it. I look foreword to hearing some great debates! :)\n\n",
        "rating": "Tech"
    },
    {
        "name": "Rishav  Kumar",
        "school": "Brookfield East",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Sarah  Lazzaro",
        "school": "Flintridge Preparatory",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Wujun  Li",
        "school": "Overlake independent",
        "paradigm": "Last changed on\nThu February 18, 2021  at 2:08 PM PDT\n\n\nWorking in software industry, new to debate judging.\nPrefer to see opinions supported by data and facts, key points summarized with simple, clear and easy understanding sentences.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Yiji  Lin",
        "school": "St John's School",
        "paradigm": "Last changed on\nWed March 3, 2021  at 10:35 AM CDT\n\n\nI am a parent and lay judge.\nPlease don't speak too fast. I will try to listen to every arguments.\nPlease weigh your in summary and final focus.\nI will vote for whoever is more persuasive.\nBe nice and good luck!\n\n",
        "rating": "Lay"
    },
    {
        "name": "jian  liu",
        "school": "Potomac Debate Academy",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Jicheng  Liu",
        "school": "Centennial High School",
        "paradigm": "Last changed on\nFri December 18, 2020  at 6:00 AM EDT\n\n\nWell, I myself didn't have any debate experience at all. I've been judging public forum debates in the past several years, but I still consider myself a lay judge.\nWith that being said, my final decision usually heavily depends on your own summary and final focus. You help me to understand why you are winning, including why your team's contentions still hold while your opponent's do not.\nI prefer you talking in a relatively slow pace but it's totally up to you to make yourself comfortable.\nEnjoy!\n\n",
        "rating": "Lay"
    },
    {
        "name": "Wesley  Loofbourrow",
        "school": "Hire",
        "paradigm": "8 rounds\n\n\n\n\n\n\n\n\n\n\n\nLast changed on\nThu September 16, 2021  at 1:24 AM PDT\n\n\nTech savvy truth telling/testing debaters who crystallize with clarity, purpose persuasion&amp;pathos will generally win my ballot.\n\nFor Greenhill RR -- consider my guidance on speed carefully, and don't forget the big picture while you are warring furiously on the line by line. \n\nSpeed: Reading a Card -- light-speed + speech doc; Constructives: fast + slow sign posting please; Rebuttals: I prefer the slow spread with powerfully efficient word economy myself, but you do you. \nCollege Parli -- Arguments that heavily weigh on the core ground intended by the topic always tend to strike me as more persuasive. A unique procedural element of Parliamentary debate is the ability to ask a question during opponent's speech time; debaters who utilize this tool to further conversational turns increasing analysis on a key issue usually impress me as well.\nPolicy -- AFFs advocating topical ethical policies with high probability to impact real people suffering right now are best in front of me. I expect K AFFs to offer solid ground and prove a highly compelling advocacy. Procedural fairness is probably the only fairness arguments I ultimately consider. And you play to win the game. Give me clash: prove you can engage a policy framework as well as any other competing frameworks simultaneously, while also giving me compelling reasons to prefer on FW. Anytime you are able to demonstrate valuable portable skills or a superior model of debate you should tell me why that is a reason to vote for you.\nLD -- See Policy above, and also Parli for cross-examination analysis. While this event has evolved considerably, I am still a firm believer that Value/Criterion is the straightest path to victory, as a strong V/C FW will either contextualize impacts to a policy/plan advocacy, or explain and justify an ethical position or moral statement functioning as that necessary advocacy. Also, V/C allows a debater to jump in and out of different worlds, advocating for their position while also demonstrating the portable skill of entering into an alternate FW and clashing with their opponent on their merits. An appropriate V/C will offer fair, reasonable, predictable, equitable, and functional Ground to both sides. I will entertain any and all theory, kritiks, T, FW. procedure, resolution-rejection/alteration, etc. -- but fair warning, positions that do not directly relate to the resolutional topic area will require a Highly Compelling warrant(s) for why. At all times, please INSTRUCT me on how I am supposed to think about the round.\nPublic Forum -- In order to further value open access to debate, I try my best to adapt myself to public forum debates rather than expecting debaters to adapt to me as I do in the other debate events. Part of what will help me is to articulate the reasoning for preferring an interpretation, whether of a rule, a norm, macro-strategies, or anything else, so that I can evaluate with understanding. Follow claim-warrant-impact-weighing and speak with authority.\nPlease ask specific questions before the round if you have any.\nSo...that is my paradigm proper, intentionally left very short. I've tried the more is more approach, and I have become fond of the less is more. Below are random things I have written, usually for tournament-specific commentary.\nWorlds @ Coppell:\nI have taken care to educate myself on the particulars of this event, reviewing relevant official literature as well as reaching out to debate colleagues who have had more experience. My obligation as a fair, reasonable, unbiased and qualified critic requires me to adapt my normal paradigm, which I promise to do to the best of my abilities. However, this does not excuse competitive debaters from their obligation to adapt to their assigned judge. I adapt, you adapt, Fair.\nTo learn how I think in general about how I should go about judging debates, please review my standard Judge Paradigm posted below. Written short and sweet intentionally, for your purposes as Worlds debaters who wish to gain my ballot, look for ways to cater your strengths as debaters to the things I mention that I find generally persuasive. You will note that my standard paradigm is much shorter than this unique, particularized paradigm I drafted specifically for Worlds @ Coppell.\nWesley's Worlds Paradigm:\nI am looking for which competitors perform the \"better debating.\" As line by line and dropping of arguments are discounted in this event, those competitors who do the \"better debating\" will be \"on balance more persuasive\" than their opponents.\nStyle: I would liken Style to \"speaker points\" in other debate events. Delivery, passion, rhetoric, emotional appeal. Invariably, the power of excellent public speaking will always be anchored to the substantive arguments and authenticity of advocacy for the position the debater must affirm or negate. While I will make every effort to separate and appropriately quantify Style and Content, be warned that in my view there is an inevitable and unbreakable bond between the two, and will likely result in some spillover in my final tallies.\nContent: If I have a bias, it would be in favor of overly weighting Content. I except that competitors will argue for a clear advocacy, a reason that I should feel compelled to vote for you, whether that is a plan, a value proposition, or other meaningful concept.\nPAY ATTENTION HERE: Because of the rules of this event that tell me to consider the debate as a whole, to ignore extreme examples, to allow for a \"reasonable majority\" standard to affirm and a \"significant minority\" standard to negate, and particularly bearing in mind the rules regarding \"reasonability\" when it comes to definitions, I will expect the following:\nA) Affirmatives will provide an advocacy that is clearly and obviously within the intended core ground proffered by the topic (the heart of hearts, if you will);\nB) Negatives will provide an advocacy of their own that clashes directly with the AFF (while this is not completely necessary, it is difficult for me to envision myself reaching a \"better debating\" and \"persuasion\" standard from a straight refutation NEG, so consider this fair warning); what the Policy folk call a PIC (Plan-Inclusive Counterplan) will NOT be acceptable, so do not attempt on the NEG to offer a better affirmative plan that just affirms the resolution -- I expect an advocacy that fundamentally NEGATES\nC) Any attempt by either side to define their opponent's position out of the round must be EXTRAORDINARILY compelling, and do so without reliance on any debate theory or framework; possibilities would include extremely superior benefits to defining a word in a certain way, or that the opponent has so missed the mark on the topic that they should be rejected. It would be best to assume that I will ultimately evaluate any merits that have a chance of reasonably fitting within the topic area. Even if a team elects to make such an argument, I still expect them to CLASH with the substance of the opponent's case, regardless of whether or not your view is that the substance is off-topic. Engage it anyways out of respect.\nD) Claim-Warrant-Impact-Weighing formula still applies, as that is necessary to prove an \"implication on effects in the real world\". Warrants can rely on \"common knowledge\", \"general logic\", or \"internal logic\", as this event does not emphasize scholarly evidence, but I expect Warrants nonetheless, as you must tell me why I am supposed to believe the claim.\nStrategy: While there may be a blending of Content &amp; Style on the margins in front of me as a judge, Strategy is the element that I believe will be easy for me to keep separate and quantify unto itself. Please help me and by proxy yourselves -- MENTION in your speeches what strategies you have used, and why they were good. Debaters who explicitly state the methods they have used, and why those methods have aided them to be \"on balance more persuasive\" and do the \"better debating\" will likely impress me.\nPOIs: The use of Questions during opponent's speech time is a tool that involves all three elements, Content/Style/Strategy. It will be unlikely for me to vote for a team that fails to ask a question, or fails to ask any good questions. In a perfect world, I would like speakers to yield to as many questions as they are able, especially if their opponent's are asking piercing questions that advance the debate forward. You WANT to be answering tough questions, because it makes you look better for doing so. I expect the asking and answering of questions to be reciprocal -- if you ask a lot of questions, then be ready and willing to take a lot of questions in return. Please review my section on Parli debate below for final thoughts on the use of POI.\nIf you want to win my vote, take everything I have written above to heart, because that will be the vast majority of the standards for judging I will implement during this tournament. As always, feel free to ask me any further questions directly before the round begins. Best of luck!\n\n",
        "rating": "Tech"
    },
    {
        "name": "Jamie  Ma",
        "school": "Hire",
        "paradigm": "Last changed on\nFri February 5, 2021  at 8:44 AM PDT\n\n\nI competed in both speech &amp; debate on CHSSA (CA) and NSDA circuit for 4 years with a focus in platform events, but am familiar with all IEs.\nI also competed in PF and Parliamentary but consider me a lay judge as I do not particularly like spreading. I will flow, however. As someone heavily trained in performance and delivery, I will take yours into account.\nWe may be virtual, but continue to behave appropriately and professionally. \nI privately coach elementary, middle &amp; high school speech and debate, as well as teach private speech writing and speech delivery classes. Contact me at jamiejjma@gmail.com for any comments, questions or concerns.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Irene  Madejski",
        "school": "The Harker School",
        "paradigm": "Last changed on\nThu July 23, 2020  at 6:52 AM PDT\n\n\ni debated pf for four years at nueva with anjali ramanathan and graduated in 2020. in the fall i'll be attending uchicago!\ni haven't had time to sit down and write a paradigm yet, but my view of debate is very similar to anjalis and she does a good job explaining hers here: https://www.tabroom.com/index/tourn/postings/judge.mhtml?judge_id=1287777&amp;tourn_id=16664\ntl;dr: i'll hear basically anything unless its problematic, i like clear narratives/link stories with weighing, speed isn't an issue unless your unclear/blippy (send me a speech doc though!!), and have fun because then i'll have more fun :))\ndo let me know if you have any questions and i'd be happy to answer them!!\n\n",
        "rating": "Tech"
    },
    {
        "name": "vaibhav  Mahajan",
        "school": "Potomac Debate Academy",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Yeshwant  Mahambare",
        "school": "Westwood",
        "paradigm": "Last changed on\nFri September 11, 2020  at 1:17 PM CDT\n\n\nI am a parent judge and I've been judging rounds for three years (mainly PF) - do not read any progressive arguments including, but not limited to\n- Theory/T\n- Kritiks\n- Plans/Counterplans\nIf you make a non-topical argument, I will not evaluate it.\nPlease explain your arguments at a conversational rate as I will not consider them if I can't understand what you are saying.\nBe kind and respectful to me and your opponents. Don't be rude during CX- I will reduce speaker points\nDo not introduce new arguments in final focus, I will not consider them in my decision.\nI will not disclose, please refer to the ballot for critiques. Please time yourselves.\n\n",
        "rating": "Lay"
    },
    {
        "name": "Michelle  McInnis",
        "school": "ModernBrain",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Noah  Mengisteab",
        "school": "Delbarton School",
        "paradigm": "Last changed on\nFri December 4, 2020  at 1:42 PM EDT\n\n\nBackground:\nAssistant Director of Forensics - Delbarton School (2020 - present)\nDirector of Debate - Duchesne Academy (2017-2020)\nMarist '16// Rice University '20\nEmail chain: Please add BOTH delbartonpf2020@gmail.com &amp; nmengisteab@gmail.com\nPronouns: he/him/his\nImportant changes for 2020-21 Season: \nEmail Chains: 1st speaker of the 1st speaking team should start an email chain as soon as you get into the Zoom/NSDA room. Teams need to send their full case docs and cards by the end of their constructive speeches. Additionally, teams need to send all new evidence read in rebuttal immediately after rebuttal speeches. Ideally, no one should need to ask to take prep to view or call for evidence. Add me to the email chain using BOTH delbartonpf2020@gmail.com and nmengisteab@gmail.com\nThe subject should have the following: Tournament Name - Rd # - Team (side/order) v Team (side/order) .\nEvidence - While I prefer debaters read card text, I'm okay with paraphrasing. However, I require you to cut cards for all evidence referenced in the round. These are properly cut cards  (Thank you Christian Vasquez for the link). If you don't cut cards then you might want to consider striking me. IF YOUR CARD ISN'T CUT AND I CALL FOR IT, I WON'T CONSIDER IT. Cut cards promote better research and debate ethics. I understand fitting sources into speeches, but lying about what your evidence says ruins the ethos of the round and cheats everyone of the educational and competitive components of this activity. And I'm tired of calling for evidence that contradicts the tag read in the round.\nMain PF Paradigm:\n1.) I look at the round through an offense/defense paradigm. Ultimately, offense wins debates. It will be hard to just win off just terminal defense. On my flow, offense requires a link/warrant, an impact, and frontlining. Miss one and it will be harder for me to flow your offense.\n2.) Speeches must build off of each other. It’s not enough to just read some offense or defense in one speech and only extend it at the very end in the Final Focus. Rebuttals need to be line-by-line with 2nd rebuttals frontlining major turns for at least 30-60 seconds. Any offense or defense you want me to look at on my flow needs to be cleanly extended, especially in the Summary and the Final Focus.\n3.) Summary and Final Focus should mirror each other. I don't care about the 1st speaking team disadvantage in summary because there are other advantages in the round. You should extend defense in first summary and similar offense.\n4.) Please weigh. It makes it a lot easier to evaluate the round if you warrant what I should look to first. Make sure it's comparative weighing and uses timeframe, magnitude, and probability. Strength of link is a fake term for probability. Clarity of impact is not real weighing.\n5.) I'll evaluate (almost) anything. Expect that I'll have already done a lot of research on a topic, but I'll evaluate anything you have me flow (tech over truth). The only times I will interfere (and most likely vote you down) would be when the args/examples presented are blatantly racist, sexist, homophobic, anything ridiculous like \"extinction/terrorism good,\" or when I know a piece of evidence being read is completely misrepresented. I will call for evidence if debaters ask me to or if I find it important in my decision. Cards should be properly cut (refer to the message at the top).\nAlso, it's up to the debaters in the round to call each other out and issue a formal evidence ethics challenge if I don't call for a card.\n6.) I will (almost) always disclose. Unless it's Nationals, I will always disclose and give an RFD. I'm also open to questions from debaters after the round. Once debaters become rude or their coaches get involved, then I'll stop my post-round discussion.\n7.) I'm 100% fine with accommodations. Increasing accessibility is important. Just communicate what you need before the round. Opponents will also receive the same benefits. If you are an opposing team that disagrees with reasonable accommodations, get over it and debate.\n\"Progressive\" PF:\nPlans/CPs/DAs - I've always been okay with “specific” plans, “pseudo” CPs, and DAs because I used them during my debate career. Just make sure you \"fit\" them within PF and the resolution. Debaters who complain about the rules of PF debate when it comes to plans and CPs – get over it and debate.\nKritics - I'm okay with the generic K's people try to run (i.e. Feminism, Capitalism, Securitization, etc.) but I am not familiar with high theory (i.e. Baudrillard, Bataille, Nietzsche).\nTheory - Theory is the highest layer of argumentation, so I'll evaluate it as such. I am okay with just a paragraph or a full shell. For me to extend your theory argument, you need to read it as soon as the abuse occurs. Additionally, theory needs to be extended throughout the debate. Otherwise, it could become disingenuous and opponents are free to use the drop as a way to win time skew. Evidence of abuse is also needed for theory (especially disclosure related shells).\nMisc:\n1.) Preflow before the round otherwise -0.3 speaker points.\n2.) Crossfires - It's usually not important to my ballot and I don't flow them. I think it’s more for y'all to clarify your args with each other. If something significant is said in cross-fire, then bring up immediately in the next speech to make it binding. Also, be nice to each other.\n3.) Speed - I am okay if you go fast (7ish/10), so long as you are clear. I reserve the right to ask for a speech doc if you go too fast.\n4.) Speaker points - Debate is an educational activity that requires good use of evidence, so I lean more towards analysis and strategy instead of persuasiveness. Scale from 27-30 with everyone starting at a 27. If you get below a 25, you did something unethical in the round. Don't expect a 30 just because you won the round.\nQuestions? Ask before the round\n\n",
        "rating": "Tech"
    },
    {
        "name": "Erik  Miller",
        "school": "Hire",
        "paradigm": "Last changed on\nSat January 18, 2020  at 2:09 AM PDT\n\n\nIn general, I am not a huge fan of counterplans, unless the topic wording is so skewed so as to not offer the Negative much ground or pose serious morality issues. The burden of proof shift then occurs and most teams in negation that I have seen are not skilled enough to run these persuasively. I'm all about impacts, harms, how do you solve. I'm a very pragmatic judge. Top \"half\" debates are fun, but definitions or theory arguments seldom convince me, but if you have a really good one, I will consider it. Open-minded. A FIERCE independent politically. Fiscal conservative.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Tim  Minvielle",
        "school": "Leland High School",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Julian  Morales-Silva",
        "school": "Hire",
        "paradigm": "8 rounds\n\n\n\nNone\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Miles  Morton",
        "school": "Campbell Hall High School",
        "paradigm": "Last changed on\nSun September 19, 2021  at 4:55 PM CDT\n\n\nMiles Morton\nDid PF at VIP, NFALD at WKU \nCurrently I coach for Campbell Hall\nAlso won NSDA in Impromptu once lol\nSpeed:\nSpeed is fine but be clear\nDisclosure:\nIf you disclose I'll give you really really high speaks\nTheory:\nI'll evaluate most arguments barring anything offensive or insensitive. If you're unsure of what I mean by this or want to clarify anything please just ask me before the round.\nCross:\nBe nice to one another please. Cross is optional if both teams agree to skip.\nLittle Things:\nI like an off-time roadmap.\nFinding cards should take under 90 seconds or its your prep.\nPlease weigh, that's largely what the decision is based on, don't focus on the line-by-line in FF, instead explain why your impacts matter more than the other teams.\nLemme know if you have any questions\nmilesmorton2@gmail.com\nHave fun!\n\n",
        "rating": "Tech"
    },
    {
        "name": "Elliot  Muhlenfeld",
        "school": "ModernBrain",
        "paradigm": "Last changed on\nSat December 26, 2020  at 7:20 AM MST\n\n\n-Speak clearly\n-Do not drop arguments\n-Do not insult the other team\n-Back up your claims with evidence, if the round is close I prefer the team with better/more evidence.\n-Be equitable in the crossfires. If you are dominating the conversation and not allowing the other team to ask questions, I'll take it as a sign that you are unwilling to defend your argument. That being said, if the other team does not ask any questions when given the chance, feel free to continue asking questions. A decent percentage of rounds I see are decided by who performs better on cross.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Anais  Nam",
        "school": "BC Academy",
        "paradigm": "Last changed on\nSat March 27, 2021  at 4:04 AM PDT\n\n\nI am a university student studying Criminology at Simon Fraser University. \nTips on receiving higher points:\n1. Please speak SLOW and CLEAR. Because we are having our tournament online, it is very hard for others to comprehend what you are trying to say. If I don't catch your words clear enough, you will end up losing a few points.\n2. Please send me your case beforehand so I can follow along. This will give you an advantage during the tournament. Please send them to n.hyunsun@gmail.com .\n3. Once you enter the conference call, please turn ON your video and audio.\n\nNot Do's :\n*** Do not yell into the microphone. If you speak too loud, it's going to sound like you are mumbling. If you speak too quietly, no one will hear you!! ***\nLastly, Have Fun:)\n\n",
        "rating": "Tech"
    },
    {
        "name": "Amy  O'Connor",
        "school": "College Prep",
        "paradigm": "Last changed on\nSat September 18, 2021  at 1:41 AM PDT\n\n\n4-year varsity debater from College Prep. Graduated in 2021.\nI evaluate the flow first, tech over truth.\nI can handle most speed - would much rather prefer a slower, clear speech to a faster, garbled speech (esp with the online format)\nEverything that's in Final Focus should have been in summary (unless it's responding to something new from second summary (which also shouldn't happen))\nWeighing\nWeigh the debate for me so I don't have to and you don't get mad when I \"do it wrong\".\nThe earlier you weigh the better.\nPlease make your weighing comparative, well warranted, and clear.\nPre-Reqs, short circuits, and link ins &gt;&gt;&gt;\nProgressive Debate \nI will evaluate and weigh any argument. That being said, please make it very clear to me because I have less direct prog experience.\nIf you have any questions feel free to ask me before the round\nGood Luck :)\nmy email is amyoco@bu.edu reach out if you have any questions or concerns\n\n",
        "rating": "Tech"
    },
    {
        "name": "Fang  Pan",
        "school": "The Quarry Lane School",
        "paradigm": "Last changed on\nSun September 19, 2021  at 2:41 AM PDT\n\n\n- Parent judge\n- Please be respectful and make sure to speak clearly and not too quickly. It is also important to thoroughly explain each contention/analysis.\n- Try to avoid using debate terminology.\n- Good luck and have fun!\n\n",
        "rating": "Lay"
    },
    {
        "name": "Rosario  Parra-Sanchez",
        "school": "The Cambridge School",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Neeta  Patil",
        "school": "Northwood High School",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Johanna  Penttila",
        "school": "Notre Dame San Jose",
        "paradigm": "Last changed on\nSun October 3, 2021  at 4:16 AM PDT\n\n\nI'm a second year PF parent judge with MA in communications and political science. My judging is based on evidence and argumentation. You win points by playing by the rules and being polite: new arguments in final focus will be ignored.\n\n",
        "rating": "Lay"
    },
    {
        "name": "Balaraju  Perla",
        "school": "Eden Prairie High School",
        "paradigm": "Last changed on\nFri November 6, 2020  at 8:00 AM CDT\n\n\nI am a relatively inexperienced judge. I won't be able to get arguments down if you spread, so don't speak too fast.\nI value clean extensions and cross-examinations when I make my decision.\nImpacts and weighing are probably the biggest factors that affect my final decision.\nTech&gt;Truth\n\n",
        "rating": "Lay"
    },
    {
        "name": "Kitiny  Phumchun",
        "school": "Honor Academy",
        "paradigm": "Last changed on\nTue September 14, 2021  at 6:11 AM PDT\n\n\n*Online: Unless a tournament prefers a specific method, I prefer e-mail chains. I'll drop my e-mail to be included when I'm in your call. I am almost always 5-10 minutes early, unless I'm judging flights, in which case I'll do my best.\nPlease go slower online. I'll let you know if you cut out and let you restart from the point connectivity becomes an issue. I'll do my best on my end to be as fair as possible within the limits of keeping the round reasonably on time. If the tournament has a policy (ex. if it takes 15 minutes to reconnect, that's a forfeit), I'll go by those.\nSeptober/NATO: If I have to listen to Russia nuke war scenarios for two months straight, please, please compare your reasons on both sides why I prefer your evidence/analysis/what-have-you. I need it painstakingly clear. Please. \nBackground: 3 yrs of college traditional policy (Stock/CPs/T, nothing cool) &amp; some parli. I coach PF. Pronouns are she/her.\nPF:\nI believe paraphrasing will just never be as honest as reading cut cards, so I'll try to incentivize better norms: if you don't paraphrase, tell me sometime in the round: \"all evidence we introduced was in cards, boost our speaks\" and I will by .5. To clarify - if the 1st speaker doesn't paraphrase in constructive, the .5 boost goes to the first speaker. If the 2nd speaker doesn't paraphrase new cards read in rebuttal, it's .5 for them.\nDisclosure is probably good because evidence ethics in PF are awful, but I'm more likely to reward you (in speaks) for doing it than drop a team that doesn't, particularly if that team is a small school.\nIf it's in final focus, it better be in summary. Signpost well.\nCollapsing, grouping, and implicating = good, underrated, easy path to my ballot! Dumping as many blippy, unwarranted responses as you can on the flow to see which one your opponents forget to cover and try to exploit in the back half = overrated, not fun, will probably annoy me.\nI'm super into strategic concessions. \"It's okay that they win this, because we win here instead and that matters more bc...\"\nI have a soft spot for framing. I'm most interested when the opposing team links in (ex. team A runs \"prioritize mitigating structural violence,\" team B replies, \"yes, and that's us,\"), but I'll definitely listen to \"prioritize x instead\" args, too. Just warrant, compare, etc.\nAll else fails, I will 1) look at the weighing, then 2), evaluate the line-by-line to see if I give you reasonable access to those impacts to begin with. Your opponents would have to really slip up somewhere to win the weighing but lose the round, but it's not impossible. I get really sad if the line-by-line is so convoluted that I only vote on the weighing - give me a clean place to vote. I'll be happy if you do the extra work to tell me why your weighing mechanism is better than theirs (I should prefer scope over mag because x, etc).\nLD:\nI’m a better judge for you if you're more trad/LARP/anything that appeals more to my very traditional policy background. I'm a fan of straightforward plan/counterplan debates. The more progressive, the more you should either A) strike me if possible (I want to be fair to you), or B) explain it to me slowly and simply - I’m open to hearing it if you’re willing to adjust how you argue it. Send a speech doc and assume I'm not as well-read as you.\nAll:\nIf it's the first round of the morning, the coffee hasn't kicked in yet, skip everything above (other than the \"this is online debate please go slow,\" go even slower now) - hello, I'm your lay judge this round, please debate accordingly.\nContent warnings should be read for graphic content. Have an anonymous opt-out. I've seen teams use Google Forms.\nCompare warrants + tell me why your args matter/what to do with them.\nDon't post-round, thanks.\nHaving a sense of humor and being friendly/accommodating toward your opponents is the easiest way to get good speaks from me. I gave two 30s last season and one was for the nicest debater I've ever come across.\nIf I smile, you did something right. If I nod, I'm following what you say. I will absolutely tilt my head and make a face if you lost me or you're treading on thin ice on believability of whatever you're saying. If I just look generally unhappy - that's just my default face. ¯\\_(ツ)_/¯\n\n",
        "rating": "Tech"
    },
    {
        "name": "Don  Pogreba",
        "school": "Parker School",
        "paradigm": "Last changed on\nFri September 24, 2021  at 7:45 PM HST\n\n\nNOTE: This is geared towards policy debate at the moment, but much of the logic here applies to PF.\nAdditional PF-specific notes at the top:\nI find the practice of card paraphrasing really problematic. It's educationally unsound and ethically problematic because the structure of the event really makes it difficult to check abuse. I would much rather see a long card with aggressive highlighting than a paraphrase.\nIf you are reading one-sentence cards or paraphrased cards, you should know that I will be quite receptive to a theory block about it. If you present a card inside quotation marks that is not an actual quote, I will vote on that evidence abuse almost every time.\nIf we're going to run 20+ cards in public forum rounds, my expectation is that both teams share speech docs with full cut cards at the start or end of their speeches. Don't send cards one at a time, don't send one-sentence quotes, send full, cut cards.\nThat being said, my preference is for evidence-heavy debate (at least in constructives) where the cards provide the warrants and backing evidence.\nMy biggest pet peeve is teams reading blocks in rounds that they don't really understand and are maybe reading for the first time. There are moments when you are going to be surprised by a position or case in a round, but most of the time, you should be familiar with the blocks you read. This activity has to be more than teams reading blocks written by their coaches and other debaters. I want smart, round-specific analytical arguments and will give far more credit to a round-specific claim than something you read from a block.\nI have been involved with policy for a long time, but have been out of the judging circuit after a long pause from the activity as a coach. In general, that means I am open-minded about any kind of argumentation but tend to prefer a policy-oriented round. I will listen to and vote for kritiks and critical Affs but I will be very sympathetic to arguments against K Affs. Very sympathetic!\nHappy to vote on big impact positions, but perhaps more inclined to listen to smart analytical analysis of flaws in the evidence and link stories than most judges.\nPerhaps a bit more clarification here is warranted: I really dislike the trend of contemporary debate to have rounds boil down to arguments about fairness/reasonability/etc. These arguments are often reductive and repetitive. They also encourage judge intervention if they become major voting issues, Make them in the constructives, but by rebuttals, let's move to more substantive analysis.\nA few things I don't like\nReally rapid analytical arguments without context or development (fewer, better analyticals are better for me), arguments that are exclusionary or demeaning, misrepresentation of evidence, stripping cards of their warrants in your highlighting.\nThings I do like \nThoughtful comparison of impact calculus in rebuttals, respectful debate that is inclusive, thoughtful analysis of framework debates, signposting arguments.\nThings worth knowing: \nI want the 2AC/2NC/1NR/1AR segment of the debate to compare evidence and analysis. It's great that you've got some prepared frontlines in your folders, but I am far more interested in strong in-round analysis than in competing prepped positions.\nIf the Neg runs a series of contradictory 1N shells, I am very inclined to consider Aff arguments that claim it's an abusive strategy. I prefer the Neg to take an intellectually consistent approach to the round. Don't run a K that says state action is genocide and a states counterplan and expect that you'll easily get out of it by kicking one in the block.\nI flow what I can hear. Sure, I will look at the e-mail chain, but even if we're on Zoom, I want to be able to hear and understand your cards. I am not particularly interested in policy debate becoming an activity where five people read Word documents sent to one another. I will use your doc to supplement my flow, but I expect you to be clear enough that I can understand both tag and cards.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Mirko  Predosin",
        "school": "Mountain View High School",
        "paradigm": "Last changed on\nSat September 18, 2021  at 11:30 AM PDT\n\n\nI have many years of experience as both a debater and judge in both high school and college competitions. I competed and judged many policy debate rounds. I am still fairly new to PF debate having only judged two tournaments so I may bring my policy bias in the round.\nSpeed is fine as long as you are understandable. Please weigh arguments and explain why you should win the round.\nSpeak clearly and be persuasive. Be polite and respectful at all times.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Fiorella Esther Pulido",
        "school": "Hire",
        "paradigm": "8 rounds\n\n\n\n\n\n\n\n\n\n\n\nLast changed on\nThu October 29, 2020  at 11:44 PM EDT\n\n\nUse speechdrop.net for sharing speech documents. No more email or flashdrive problems. The affirmative should have this ready to go before the round starts.\n(Copy and paste Erick Berdugos paradigm ) but to summarize my general beliefs .....\nAffirmative :\n1) The affirmative probably should be topical. I prefer an affirmative that provides a problem and then a solution/alternative to the problem. Negatives must be able to engage. Being independently right isn't enough.\n2) Personal Narratives - not a fan of these arguments. The main reason, is that there is no way real way to test the validity of the personal narrative as evidence. Thus, if you introduce a personal narrative, I think it completely legit that the personal narrative validity be questioned like any other piece of evidence. If you would be offended or bothered about questions about its truth, don't run them.\n3) K -Aff : Great ,love them but be able to win why either talking about the topic is bad, your approach to talking about the topic is better,why your method or approach is good etc, and most importantly what happens when I vote aff on the ballot.\n4) Performance : Ehh- I’m not the judge to run a good perf bu but I am willing to listen to the arguments if you can’t rightfully warrant them . Perf cons ARE an issue and can cost you the ballot . Be consistent! 5) EXTEND ! EXTEND! EXTEND! “Extensions of the aff are overviews to the 1 ar” .... no they are not . I want to flow them separately not in some clump . It gets messy.\nNEGATIVE :\n1) Kritiks : I am not familiar with a large range of lit but I know plenty how to judge a good kritik and I enjoy it. Do not feel you need to run a K to win any sort of leverage in the debate ... you’re better off reading something you are comfortable defending than a crappy K you have no knowledge of . You need to be able to articulate and explain your position well don’t just assume I am familiar with your authors work. Alts need to tell me cause and impact aka what will the after look like ?? K MUST have a specific link. K arguments MUST link directly to what is happening in THIS round with THIS resolution. I am NOT a fan of a generic Kritik that questions if we exist or not and has nothing to do with the resolution or debate at hand. Kritiks must give an alternative other than \"think about it.\" Have good blocks to perms !!! Especially if you have no links to the advocacy .\n2) DA : Go for it ! I lean towards topical / substantive larpy rounds so I will definitely vote on a good DA . Make sure your impact calculus is outweighing and tell me how ! Internal links should be clear . If the impacts are linear that needs to be articulated as well . Pretty simple but feel free to ask me for clarifications !\n3) CP/ PIC : Strategic if done correctly ! For the CP there needs to be net benefits and they should be extended throughout the round . Please don’t read generic cards you stole off a case file ( I can tell and it makes for a redundant debate ) I won’t vote against you for it but .. don’t plz . Theory against abusive CPs is completely legitimate. For the PIC - keep it clean ! *paradigm under construction *\n\n",
        "rating": "Tech"
    },
    {
        "name": "Julie  Qi",
        "school": "BC Academy",
        "paradigm": "Last changed on\nSat September 18, 2021  at 2:56 AM PDT\n\n\nHi! My name is Julie (She/Her/Hers), and I am currently a sophomore at the University of California, Berkeley. I was a competitive debater and have competed in PF (with some parliamentary and worlds) in high school for 4 years.\nPlease add me to the email chain if one is being used in the tournament:\njulieqi@berkeley.edu\nJudging Paradigm\n1. I love debates with fiery clash, but please remember to be respectful to each other! If I hear anything inappropriate (any ___ism), I will lower your speaks precipitously. If serious enough, you will not only lose the round, but I will also report you to the tournament officials or tabroom.\n2. If you don't extend your arguments in your Summary and Final Focus, they will be dropped on my flow.\n3. Do your best to write the ballot for me and PLEASE weigh your arguments. If you do not tell me how I should evaluate the round, you do not tell me how you win the round lol. At the same time, warrant your arguments! (don't rely on the existence of a card or a tagline as a sufficient explanation for your argument).\n4. I do not flow crossfires, therefore if anything important comes up, please mention it in your speeches so I take a note of it when I weigh the round at the end.\n5. I usually don't call for evidence, but I expect you to be prepared to hand any evidence requested to myself or your opponents ASAP. If you fail to provide evidence in a timely manner, I will start charging you prep time to find it. Usually, I will give you 30 seconds to find the card.\n6. Only have a framework if you are going to use it throughout the round. I do not like super technical conversations about it if none of you are actually framing your impacts and arguments around it.\n7. I can handle speed, but please no spreading if possible. Enunciate and project yourself, and do not mumble your words quickly. This will help both me and your opponents in making this debate as engaging as possible. My speaks usually start at 27, and I go up from there. I usually give speaks around 28-30. oh and if you manage to make me laugh, automatically +0.5 for you :)))\n8. Evidence &gt; Opinions \nMost importantly, have fun! If you have any questions before/after the round, don't hesitate to ask.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Adolfo  Rumbos",
        "school": "Claremont",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Albert  Sanchez",
        "school": "Christopher Columbus High School",
        "paradigm": "Last changed on\nFri September 10, 2021  at 6:50 AM EDT\n\n\nHey! I’m Albert Sanchez. In HS I did PF for a couple tournaments, LD for 3 years, and Worlds for 1 year. I’m in college on the American Parli team, where I run some IR/HIR stuff.\nIn terms of cases, I ran a lot of lay and some LARP stuff in HS. If you’re not sure what to run in front of me, ask yourself if my 8th grade sister would be able to understand your argument the way you read it. This goes for content and speed. Please don’t spread. I’m not perfect at flowing so if you really want me to catch on to something in the line by line please emphasize it. Flowing on a computer makes it easier to get stuff down tho so that’s a plus.\nFAQ:\nStance on Ks? As long as I can understand them from what you tell me in the constructive, go for it. If it requires me to go read over the cards 10 times to understand what you're saying, don't read it.\nStance on LARP? Cool with it.\nStance on T/Theory? If there's clear abuse in the round, sure.\nEmail chain? Always for it. I'll give you my email in round if you're going to start one.\nTime yourselves!\nSpeaks are silly and arbitrary so I'll be as transparent as possible (DOES NOT APPLY TO WORLD SCHOOLS). \n- You will start at a 28 pt minimum unless otherwise told by tab. You can only go up unless you are offensive in round or spread without clearing it with me and the opponent.\n- I don't care about eye contact, posture, hand gestures, or stuttering\n- Give me good signposts\n- Roadmap before you start your rebuttals (AND FOLLOW THE ROADMAP YOU GIVE ME)\n- In rebuttals, don't just read the name of the card. Summarize what it said.\n- Write my ballot for me: In the last speech tell me what the round come downs to and why you win\n- (If we're in person): If aff sits on my left and neg on my right without asking me, I will bump both your speaks. If only one does so, I'll only bump that person's speaks. If no one does so, you just start at the 28 pt minimum\nFeel free to ask questions before or after the round. I’ll talk about the round (if I’m allowed to) but I’ll also answer questions about college debate and stuff in general.\n\n",
        "rating": "Lay"
    },
    {
        "name": "Maria  Savransky",
        "school": "Bergen County Debate Club",
        "paradigm": "Last changed on\nFri September 17, 2021  at 6:38 PM EDT\n\n\nI did speech and debate in high school, 3 years of LD and 1 year in PF. I'm alright with any kind of argument you want to read (theory, k's, etc) just explain what you're reading well and make sure you can communicate your advocacy. I'm also okay with speed, but if you are planning on speaking really fast, please email me your case. My email address is msavransky01@gmail.com.\nI'm a flow judge and prefer tech &gt; truth but your arguments obviously still have to be true for me to vote for them.\nHow To Win My Ballot\nArguments should be extended in the summary and final focus speeches, if an argument is brought up in the 2nd rebuttal and final focus but not the summary, I won't vote on it.\nWeigh your arguments against those of your opponents, that's one of the most important things for me in the round! In your speeches, you should be explaining why voting for your side has a bigger impact than that of your opponents using different criteria like magnitude, scope, timeframe, probability, and reversibility. This is especially important in your final focus and summary speeches.\nYour final two speeches should look somewhat like my ballot, explain the main arguments that the round comes down to and why they should be the key voting points. Say why those arguments flow your away and weigh them against the arguments your opponents.\nDon't go for too many arguments in the final speeches, you shouldn't be talking about everything discussed in the debate, only the most important things. Otherwise, the debate tends to get messy as there ends up being a lot of extended arguments that have little interaction with each other.\nCards should be explained through out every speech, when you extend a card, you should not only be saying the name of the author but also the warrant of the card and the implication of it. Also, you should be weighing your cards against those read by your opponents i.e say why your evidence is better quality, why there is more of it, and so forth. When two teams have competing cards, this is what helps me decide which one to believe and side with.\nAll I'm all, just extend your arguments and cards in every speech, weigh the most important arguments against each other in the final speeches and you'll definitely win the round/get great speaks.\nThanks for reading and I look forward to judging you !\n\n",
        "rating": "Tech"
    },
    {
        "name": "Vlad  Savransky",
        "school": "Bergen County Debate Club",
        "paradigm": "Last changed on\nFri April 30, 2021  at 6:57 AM EDT\n\n\nPlease do not use progressive arguments in PF rounds; speak at an average rate and be nice to each other.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Courtney  Schauer",
        "school": "College Prep",
        "paradigm": "8 rounds\n\n\n\n\n\n\n\n\n\n\n\nLast changed on\nMon November 26, 2018  at 7:13 PM UTC\n\n\nCompeted: University of Minnesota Coach (Present): Emporia State University; College PrepCoached (Past): Augsburg College; Highland Park Senior High (MN)\nPUBLIC FORUM\nAlthough my primary background is in policy, I am familiar with the procedures of public forum and spent a season of my high school career competing in the format. Below are my answers to the suggested PF philosophy questions provided by the TOC.\nPlease share your opinions or beliefs about how the following play into a debate round: Speed of Delivery: Speed is fine so long as clarify doesn't suffer.\nFormat of Summary Speeches (line by line? big picture?):Both effective line by line and big picture storytelling are important to my ballot.\nRole of the Final Focus: Providing a rubric/judge instruction for my ballot\nTopicality: Generally these debates are done poorly, it's important to have a comparative metric for evaluating interpretations and a robust discussion of the various impacts to the violation. I do not view topicality in a purely \"jurisdictional\" way - offense/defense is important.\nPlans: Not needed but not automatically disallowed.\nKritiks: Sure although just like any argument, it must be explained, applied, and impacted thoroughly.\nFlowing/note-taking: I will flow the entirety of the debate.\nDo you value argument over style? Style over argument? Argument and style equally? Quality and depth of argument is the primary thing I will evaluate, but style is not unimportant by any means.\nIf a team plans to win the debate on an argument, in your opinion does that argument have to be extended in the rebuttal or summary speeches? Yes.\nPOLICY\n\"I view my role in the debate not as arbiter of truth, but critic of argument, as such I attempt to divorce myself from relative \"truth\" values of arguments.\" - Chris LoghryI like to see debaters deploying arguments that motivate and interest them.\nI don’t call for many cards. This does not mean evidence quality does not matter, or that I don’t call cards often. What it does mean is: the debaters make the arguments, not the cards. I will not view them as placeholders for warranted explanation. Not every argument requires a card to answer.\nFraming matters: provide me a macro-level filter through which to view the micro-components of the debate. The debates I find myself most frustrated with are the ones in which the 2NR and the 2AR have respectively delivered me 2NC #2 and 2AC #2 and left me to sort through the pieces. Rebuttalists that present a clear story while closing the right doors will be rewarded.\nThe more explicit you are with me in terms of my ballot, the better. This mostly goes for presumption and judge conditionality, but also for competing Frameworks/Role of the Ballots. If debaters are not explicit, there becomes no objective standard for me to use as a reference for when and where I infer these arguments.\nHave a plan for Cross-X.\nThings I like to see in cross-x: Asking precise, critical questions. Giving succinct, impactful answers. Writing down all concessions for utilization in the next speech. \nThings I hate to see in cross-x: Ad-homs. Open-ended softballs. Questions that blatantly indicate a lack of flowing. Refusal to answer reasonable questions. Repetition of questions to avoid giving answers. Poorly-timed invocations of false ethos. 4-person shouting matches.\nIf you are reading critical literature, whether on the Affirmative or Negative, please explain and utilize your method. Make the links turn the case. Have a robust explanation of the alternative. Strive for internal, philosophical consistency. Your authors have particular theories of subjectivity, violence, etc., and I want to thear them; just remember that they all can and SHOULD be ACTIVELY applied broadly to frame many portions of the technical debate.\nA speech doc is not a flow substitute.\nDebate matters just as much to your opponents as it does to you, even if for different reasons. Be mindful of this and respect your competitors.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Charles  Schletzbaum",
        "school": "Milpitas High School",
        "paradigm": "Last changed on\nSat May 29, 2021  at 1:18 AM PDT\n\n\nCo-Director: Milpitas High Speech and DebatePHYSICS TEACHERHistoryMyers Park, Charlotte N.C.(85-88) 3 years Policy, LD and Congress. Double Ruby (back when it was harder to get) and TOC competitor in LD.2 Diamond Coach (pretentious, I know)\nSummer 87: American U Institute. 2 weeks LD and congress under Dale Mccall and Harold Keller, and 2 more weeks in a mid level Policy lab.St. Johns Xavierian, Shrewsbury, Mass88~93 consultant, judge and chaperoneSummer 89 American U Coaches institute (Debate)Milpitas High, Milpitas CA09-present co-coach\nSide note/pet peeve: It is pronounced NUUUUUU-CLEEEEEEE-ERRRRRRRRR (sorry this annoys the heck outta me, like nails on the blackboard)\nALL EVENTS EXCEPT PARLI NEED TO KNOW NSDA RULES OF EVIDENCE (or CHSSA RULES OF EVIDENCE) OR DO NOT EXPECT ME TO COUNT IT(NSDA MINIMUM IS \"NAME\" AND \"DATE\" ****READ IN ROUND****) Anything else is just rhetoric/logic and 99% of the time, rhetoric vs card mans card wins.\nIf you put conditions on your opponent getting access to your evidence I will put conditions on counting it in my RFD. Evidence should be provided any time asked between speeches, or asked for during cx and provided between speeches. Failure to produce the card in context may result in having no access to that card on my flow/decision.\nPart of what you should know about any of the eventsEvents Guidehttps://www.nflonline.org/uploads/AboutNFL/Competition_Events_Guide.pdf13-14 NSDA tournament Operations manualhttp://www.speechanddebate.org/aspx/content.aspx?id=1206http://www.speechanddebate.org/DownloadHandler.ashx?File=/userdocs/documents/PF_2014-15_Competition_Events_At_A_Glance.pdf\nAll events, It is a mark of the competitors skill to adapt to the judge, not demand that they should adapt to you. Do not get into a definitional fight without being armed with a definition..... TAG TEAM CX? *NOT A FAN* if you want to give me the impression your partner doesn't know what they are talking about, sure, go ahead, Diss your partner. Presentation skills: Stand in SPEECHES AND CX and in all events with only exception in PF grand.\nALL EVENTS EXCEPT PARLI NEED TO KNOW NSDA RULES OF EVIDENCE (or CHSSA RULES OF EVIDENCE) OR DO NOT EXPECT ME TO COUNT IT(NSDA MINIMUM IS \"NAME\" AND \"DATE\"****READ IN ROUND****) Anything else is just rhetoric/logic and 99% of the time, rhetoric vs card mans card wins.\nPUBLIC FORUM:\nWhile I was not able to compete in public forum (It did not exist yet), the squad I coach does primarily POFO. Its unlikely that any resolution will call for a real plan as POFO tends to be propositions of fact instead of value or policy.I am UNLIKELY to vote for a K, as I have seen a bizarre one once, and I don't even vote for K in policy. Moderate speed is fine, but to my knowledge, this format was meant to be more persuasive. USE EVIDENCE and make sure you have Tags and Cites. I want a neat flow (it will never happen, but I still want it)I WANT FRAMEWORK or I will adjudicate the round, since you didn't. I FLOW LIKE POLICY with respect to DROPPED ARGUMENTS (if a speech goes by I will likely consider the arg dropped... this means YES I believe the 4th speaker in the round SHOULD cover both flows..)Remember, Pofo was there to counteract speed in Circuit LD, and LD was created to counter speed, so fast is ok, but tier 3 policy spread is probably not.\nALL EVENTS EXCEPT PARLI NEED TO KNOW NSDA RULES OF EVIDENCE (or CHSSA RULES OF EVIDENCE) OR DO NOT EXPECT ME TO COUNT IT(NSDA MINIMUM IS \"NAME\" AND \"DATE\" READ IN ROUND ) Anything else is just rhetoric/logic and 99% of the time, rhetoric vs card mans card wins.\nPLANS IN PFIf you have one advocacy, and you claim solvency on one advocacy, and only if it is implemented, then yeah that is a plan. I will NOT weigh offense from the plan, this is a drop the argument issue for me. Keep the resolution as broad as possible. EXCEPTION, if the resolution is (rarely) EXPLICIT, or the definitions in the round imply the affirmative side is a course of action, then that is just the resolution. EXAMPLESeptember 2012 - Resolved: Congress should renew the Federal Assault Weapons Banthe aff is the resolution, not a plan and more latitude is obviously given.If one describes several different ways for the resolution to be implemented, or to be countered, you are not committing to one advocacy, and are defending/attacking a broad swath of the resolution, and this I do NOT consider a plan.ALL EVENTS EXCEPT PARLI NEED TO KNOW NSDA RULES OF EVIDENCE (or CHSSA RULES OF EVIDENCE) OR DO NOT EXPECT ME TO COUNT IT(NSDA MINIMUM IS \"NAME\" AND \"DATE\" ****READ IN ROUND****) Anything else is just rhetoric/logic and 99% of the time, rhetoric vs card mans card wins.\nPOLICY:\nIf your plan is super vague, you MIGHT not get to claim your advantages. Saying you \"increase\" by merely reading the text of the resolution is NOT A PLAN. Claiming what the plan says in cx is NOT reading a plan. Stop being sloppy.\nI *TRY* to be Tabula Rasa (and fail a lot of the time especially on theory, Ks and RVI/fairness whines)I trained when it was stock issues, mandatory funding plan spikes (My god, the amount of times I abused the grace commission in my funding plank), and who won the most nuclear wars in the round.\nPresentation skills: Stand in SPEECHES AND CX and in all events with only exception in PF grand.\nPlease don't diss my event.I ranGlassification of toxic/nuclear wastes, and Chloramines on the H2O topicLegalize pot on the Ag topicCTBT on the Latin america topic.In many years I have never voted neg on K (in CX), mainly because I have never seen an impact (even when it was run in POFO as an Aff).(Ironic given my LD background)I will freely vote on T if it is run properly (but not always XT), and have no problem buying jurisdiction......I HAVE finally gotten to judge Hypo-testing round (it was fun and hilarious).One of my students heard from a friend in Texas that they are now doing skits and non topical/personal experiece affs, feel free, BUT DON'T EXPECT ME TO VOTE FOR IT.I will vote on good perms both ways (see what I said above about XT)SPREAD: I was a tier B- speed person in the south. I can flow A level spread *IF* you enunciate. slow down momentarily on CITES and TAGS and blow through the card (BUT I WILL RE TAG YOUR SUBPOINTS if your card does not match the tag!!!!!!)If you have any slurred speech, have a high pitched voice, a deep southern or NY/Jersey drawl, or just are incapable of enunciating, and still insist on going too fast for your voice, I will quit flowing and make stuff up based on what I think I hear.I do not ask for ev unless there is an evidentiary challenge, so if you claim the card said something and I tagged it differently because YOU slurred too much on the card or mis-tagged it, that's your fault, not mine.LD \nI WILL JUDGE NSDA RULES!!!! I am NOT tabula rasa on some theory, or on plans. Plans are against the rules of the event I judge. LD was supposed to be a check on policy spread, and I backlash, if you have to gasp or your voice went up two octaves then see below... Topicality FX-T and XT are cool on both sides but most other theory boils down to WHAAAAAAHHHH I don't want to debate their AFF so I will try to bs some arguments. It didn't work for the racism k kids in policy in the movie resolved, and drop the debater because fairness is a voter won't work either in my round (for example)-CIRCUIT LD REFER to policy prefs above in relation to non topical and performance affs- I LOVE PHILOSOPHY so if you want to confuse your opponent who doesn't know the difference between Kant, Maslow and Rawls, dazzle away :-).Clear VP and VC (or if you call it framework fine, but it is stupid to tell someone with a framework they don't have a VC and vice versa, its all semantics) are important but MORE IMPORTANT is WHY IS YOURS BETTER *OR* WHY DO YOU MEET THEIRS TOO and better (Permute)IF YOU TRY TO Tier A policy spread, or solo policy debate, you have probably already lost UNLESS your opponent is a novice. Not because I can't follow you, but because THIS EVENT IS NOT THE PLACE FOR IT!!! However there are several people who can talk CLEARLY and FAST that can easily dominate LD, If you cannot be CLEAR and FAST play it safe and be CLEAR and SLOW.....Sub-pointing is still a good idea, do not just do broad overviews. plans and counter-plans need not apply as LD is usually revolving around the word OUGHT!!!! Good luck claiming Implementation FIAT on a moral obligation. I might interrupt if you need to be louder, but its YOUR job to occasionally look at the judge to see signals to whether or not they are flowing, so I will be signalling that, by looking at you funny or closing my eyes, or in worst case leaning back in my chair and visibly ignoring you until you stop ignoring the judge and fix the problem. I will just be making up new tags for the cards I missed tags for by actually listening to the cards, and as the average debater mis-tags cards to say what they want them to, this is not advisable.PLANS IN LDPLANSIf you have one advocacy, and you claim solvency on one advocacy, and only if it is implemented, then yeah that is a plan. I will NOT weigh offense from the plan, this is a drop the argument issue for me. Keep the resolution as broad as possible.EXCEPTION, if the resolution is (rarely) EXPLICIT, or the definitions in the round imply the affirmative side is a course of action, then that is just the resolution. EXAMPLESeptember 2012 - Resolved: Congress should renew the Federal Assault Weapons Banthe aff is the resolution, not a plan and more latitude is obviously given.If one describes several different ways for the resolution to be implemented, or to be countered, you are not committing to one advocacy, and are defending/attacking a broad swath of the resolution, and this I do NOT consider a plan.I repeat, Speed = Bad in LD, and I will not entertain a counter-plan in LD If you want to argue Counterplans and Plans, get a partner and go to a policy tournament.\nGOOD LUCK and dangit, MAKE *ME* HAVE FUN hahahahahah\nhttp://www.vbriefly.com/2012/05/23/201205comments-for-the-circuit-on-the-ncfl-and-nfl-nationals-by-brad-taylor/\n\n",
        "rating": "Tech"
    },
    {
        "name": "Christian  Schock",
        "school": "ModernBrain",
        "paradigm": "Last changed on\nSun September 12, 2021  at 6:02 AM PDT\n\n\nI competed for 4 years, primarily in PF and a bit of policy. When it comes to Public Forum I don't want you to just read evidence at me, stop trying to make PF policy! Explain your evidence and warrants, give good analysis. Also I really enjoy Framework debates, if you're going to read framework carry it through the entire round. Care about FW arguments because thats how i'm going to end up voting if i'm not given an alternative FW. Make sure there is actual clash, dont just tell me why your positions are important.\nSince im fairly new to CX I dont have a ton of preferences, just dont expect me to understand super high theory off the bat, and if you do run it, make sure to explain it really well. Other than that just do your thing and be kind to each other. I am generally a laid back person, however i have a zero tolerance policy when it comes to being purposefully cruel or bigoted to your opponents or otherwise. Lets have fun and learn from each other, thats what this is all about. \n\n",
        "rating": "Tech"
    },
    {
        "name": "Zoey  Sheinberg",
        "school": "Rowland Hall",
        "paradigm": "Last changed on\nSat November 7, 2020  at 5:45 AM MDT\n\n\nHi guys!\nMy name is Zoey and I debated PF on the national circuit for all four years of high school at Rowland Hall in Salt Lake City Utah. I qualified for nationals two years in a row and have made it pretty far in some high skill national tournaments, such as Alta, Jack Howe, ASU, etc. I love debate and know a lot about debate so do not be worried about me being a lay judge in any way.\nAs for what I would like to see in rounds. First and foremost please please please be respectful. If I see or hear any homophobia, xenophobia, racism, or ignorance of any kind, wether in arguments or in cross, I will nuke your speaks if not drop your entire team. Abusiveness in arguments or presence is not welcome in the debate space. Additionally if I see debaters, specifically female or nonbinary ones, being spoken down to, interrupted, or made uncomfortable I will, again, either injure your speaks or drop you depending on the severity.\nOkay, secondly, I am totally okay with progressive debate, speed, theory, K's, tricks, etc. If you are planning on speed, I would prefer you just speak at a pace where I can flow on my computer or, if needed, send me a doc. I am pretty good with theory and K's and tricks, but please if the other team is not do not use it as a cheap way to win, I will view that as bad debate.\nAs for speeches in general, I am tech over truth, but don't push that, lie, and be abusive. Framework is cool but not necessary. PLEASE FRONTLINE! Frontlining starts as early as second rebuttal, and I expect extensions to be from resolution to impact, do not just extend through ink. Additionally please collapse, taking on too many arguments at once makes for bad debate. I expect summaries to be the best speeches in the round because you have the most to do in just three minutes so make use of your time and learn what matters in a speech. Final focus is pretty simple, weigh weigh weigh, impact impact impact. I believe that weighing should be brought up in rebuttals, but I also understand not having enough time. That being said if one team weighs in rebuttal and extends through FF, and one team waits until FF to start, there will be a large advantage for the other team. Honestly just debate well, weigh, extend resolution to impact, collapse, and be respectful :)\nThis is a hot take but I love crossfire. BUT only when it is entertaining. Cross will in no way impact who wins or your speaks but if there is abuse that can change. Please make cross fun, yes use it as a way to answer questions you need answered, but also the best part about cross is making your opponents get flustered and feel behind. Use it to your advantage, it can help in speeches. If you bring up something said in cross during a speech I will flow it but in general I will not be flowing cross.\nAs for evidence, I have high evidence standards, I am cool with paraphrasing don't worry, I think it is needed in PF, but please have everything carded and ready to show your opponents. I will only call for cards if it is contended or seems sus.\nIf I am forgetting something feel free to ask me before the round starts! Also please be on time to rounds :) it will make me like you more.\num have fun, debate well, be kind, and good luck this szn :) &lt;3\n\n",
        "rating": "Tech"
    },
    {
        "name": "Nitin  Singhal",
        "school": "Lynbrook HS",
        "paradigm": "Last changed on\nFri December 4, 2020  at 8:15 AM EDT\n\n\nspeak slow and clear\n\n",
        "rating": "Tech"
    },
    {
        "name": "Adhi  Sivathanu",
        "school": "Foothill High School",
        "paradigm": "Last changed on\nSat April 17, 2021  at 6:14 AM EDT\n\n\nI will judge based on argumentation, use of evidence, and logic. I am not a big fan of spreading either, so please talk clearly.\nAlso, it would be great if you could send a speech document after the constructive speech as my Wifi is not very good and I would not want you to lose because of that.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Sidney  Sohn",
        "school": "Flintridge Preparatory",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Laura  Soto",
        "school": "SkyHigh Academy",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "John  Spaulding",
        "school": "East Ridge High School",
        "paradigm": "Last changed on\nWed September 15, 2021  at 5:19 PM CDT\n\n\nI am a lay judge. I'm a parent judge relatively new to formal debate, but I really enjoy listening to what you have to say! \nIf you spread or go too fast, I won't understand you, and that really puts you at a disadvantage.  Please make sure you're understandable.\nThe whole point of debate is mastering the art of persuasion. I try to follow flow but may miss technical details. Don't rely on technicalities to determine if you think you won the round. Persuade me to vote for you. Make me buy your argument. I will vote based off of who holistically convinces me to affirm or negate. If the round gets muddy I go for the path of least resistance. Don't overthink it, just do your best.\nI expect teams to keep and police the timing of their own rounds. I'll only interject if I think it's egregious, but poor time management may negatively impact my impression.\n\nBe genuine and show your personality. If you tell a joke that makes me laugh I may give you an extra speaker point.\nLow speaker points are generally from low energy, an extreme lack of eloquence or an abundance of ummms and uhhhs. \nAbusive behavior, racism, sexism and homophobia etc. will be reported to your coaches, and I reserve the right to drop you on the spot. \nHave fun and good luck!\n\n",
        "rating": "Lay"
    },
    {
        "name": "Ranjani  Srikrishnaswamy",
        "school": "Illinois Independent Entry",
        "paradigm": "Last changed on\nFri September 10, 2021  at 8:46 PM EDT\n\n\nI'm a parent judge.\nI watched some demo debates on the topic and read some topic analysis so I know some of the basics of what's going on. \nMy biggest thing... Please don't spread!!!! I can follow a slower thoughtful round and evaluate arguments, however, if you speak quickly and don't signpost, I will get lost.\n\nPlease be courteous, respectful, and kind to one another, we are all here to learn. \n\nGood Luck!\n\n",
        "rating": "Lay"
    },
    {
        "name": "Sabrina  Stark",
        "school": "Hire",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Donald  Steiner",
        "school": "BASIS Chandler High School",
        "paradigm": "Last changed on\nWed June 10, 2020  at 12:50 AM MST\n\n\nI have been debating and doing IE's as a competitor and judge since the 1970's with a long break in the 90's and 2000's while working in the private sector. I have been coaching a team that does primarily Oregon-style parli and Public Forum debate, but I did NDT and CEDA as a college competitor and understand all formats.\nI judge as a policy maker looking for justification to adopt the resolution, and will accept well-justified arguments on both substance (the issues of the resolution) and procedure (framework, theory). In policy rounds I have a bias against affirmative K's, because I believe the Aff prima facie burden requires that I be given a reason to adopt the resolution by the end of the first Aff constructive in order to give the Aff the ballot. Arguments founded in social justice approaches are fine as long as they lead to a justification for adopting the resolution and changing the status quo.\nI can handle speed but remember I'm not seeing your documentation--a warrant read 600 words a minute at the pitch of a piece of lawn equipment might as well not be read from the judge's seat. You flash each other, but not me, so make sure I understand why your evidence supports your argument. I won't debate for you, and I don't flow cross-ex/crossfire. If you want me to consider an argument, introduce it during one of your speeches. In formats other than policy, particularly in Public Forum, I expect a slower rate and more emphasis on persuasion with your argumentation as befits the purpose of those other formats.  In LD, I expect arguments to be grounded in values, not \"imitation policy.\"\nI will automatically drop any debater who engages in ad hominem attacks--arguments may be claimed to have, for example, racist impacts, but if you call your opponents \"racists,\" you lose--we have too much of that in the contemporary world now, and we are trying to teach you better approaches to argument and critical thinking.\nAbove all else, I like good argumentation, clash, and respectful conduct. No personal attacks, no snark. Humor welcome. Let's have some fun.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Liu  Tang",
        "school": "The Cambridge School",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Patrick  Tapia",
        "school": "HS2 Academy",
        "paradigm": "Last changed on\nThu April 1, 2021  at 2:10 PM PDT\n\n\nBrief background of my debate experience:\nI have been involved in speech and debate since the 90's, having debated policy in high school for 4 years and another 4 years as a scholarship debater at USC (NDT debate). I also coached a LD program in a Southern CA high school a few years back. Now, I run a Public Forum program for HS2 Academy.\nMy philosophy:\nI will buy most reasonable arguments as long as they are well-supported. Generally tech &gt; truth\nSpreading is fine as long as it is CLEAR. Otherwise, your speaker points will reflect this.\nBe courteous to each other. Rudeness will be reflected in your speaks.\nPF specific:\n2nd Rebuttal MUST respond to 1st Rebuttal or I consider arguments dropped\nProg: No Kritiks in PF for me (I just don't think it's the right forum); I may buy theory arguments as long as they're not frivolous or nonsensical.\nI don't flow crossfire, but I will factor it in speaks.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Jon  Telebrico",
        "school": "Sage Hill School",
        "paradigm": "Last changed on\nSun October 3, 2021  at 8:47 AM PDT\n\n\nAbout:\nArchbishop Mitty '19\nClaremont McKenna College '23\nHi there! My name is Jon Joey (he/they) and I did Parli, PF, and Congress pretty competitively during my four years competing for Archbishop Mitty High School, where I've been an Assistant Debate Coach the past two years as well.\nIn the interest of inclusivity, if you have ANY questions about the terms or jargon that I use in this paradigm or other questions that are not answered here, feel free to shoot me an email at jtelebrico23@cmc.edu\nWSD Update for Chuck Ballingall:\nOctofinalist at the 2019 NSDA World Schools Invitational.\n- While the format privileges style over substance, I do give weight to the strength of arguments I’m evaluating and frame my interpretations of style through that primary lens. - Roadmap clearly and identify how many substantive arguments your team will be running across the speeches.\n- Give me framing arguments from the start of the debate and use evaluative metrics strategically in the final speeches. - Clearly explain how you outweigh either principled arguments over practical, or vice-versa. Make comparative arguments and do weighing please!\nPF Paradigm (last updated 9/12/21)\nJack Howe Update:\n\nFeel free to read your cool, funky cases on this topic in front of me—I highly encourage it.\nEvery argument requires a warrant for me to evaluate it—it's not enough to say \"extend xyz author/statistic\" without an accompanying warrant. Please extend warrants in both summary and final focus.\nWeighing is also SUPER IMPORTANT. Start doing this in summary. This also goes beyond just impacts—do link-level weighing and collapse pls.\nOkay, so apparently people have pedagogical issues with FYOs and SYOs (I am a Third Year Out) not caring about crossfire so while I maintain that I won't flow crossfire, you may generate offense off of concessions or contradictory answers made in CF ONLY if you explain and strategically utilize the indicted claim to generate meaningful clash.\nFirst Summary doesn't need to extend defense unless they frontline args in second rebuttal. However, it's probably strategic for second rebuttal to answer first rebuttal and start frontlining.\nIf it's in final focus, it has to be in the summary.\nImpacts should be terminalized. I prefer numbers to scalar impacts, which should always be contextualized within the evidence.\nImpact framing is also very cool.\nI think theory and kritikal arguments are severely underutilized in PF. Open to any kind of argument on these layers.\nTo minimize intervention, I won't call for the card unless you tell me to.\nHowever, I do reserve the right to intervene on behavior that I find explicitly oppressive and morally reprehensible; if it's implicit or you're just excessively rude/aggressive in general I will simply tank your speaks.\nMy current speaks average aggregated across both Parli &amp; PF is a 28.8 [H/L = 30/27]\nSpeech docs are very appreciated.\nSignpost clearly.\nAsk me what my thoughts are on grand cross right before it should happen.\n\nParli Paradigm (last updated 8/5/21):\nGeneral\n\n\nThe debate space is yours. Run as slow or fast, lay or tech of a round as you want.\n\nIf on a panel and you punt the lay judge, I won't intervene but I will be very sad.\n\nI keep a really tight flow and am tech over truth. I do, however, reserve the right to intervene and drop teams if I witness something morally reprehensible or blatantly problematic.\n\n\nI prefer things to be framed as Uniqueness, Link, Impact but it probably doesn't matter that much. Just don't throw out unwarranted claims and expect that to automatically be offense for you.\n\n\nDoing impact weighing/comparative analysis between warrants is key to coming out ahead on arguments.\n\n\nCollapsing is really important. Extend some defense on the arguments you're not going for and then go all in on the arguments that you're winning.\n\n\nRebuttals are also very important! The 1NR cannot be a repeat of the 2NC and the 1AR should be engaging with some of the new responses made in the block as well as extending turns made in the 2AC. Give overviews, do comparative world analysis, do strategic extensions.\n\nProbably a lower threshold than most for like phil and tricks 'n stuff.\n\nFramework\n\nDefault to net bens.\nIf the 1AC doesn't define stuff but the 1NC does, I find myself pretty skeptical of 2ACs that try to backfill the framework layer.\nDown for all kinds of trichotomy arguments (i.e. feel free to run policy rounds on value/fact/metaphor topics if you want to justify it to me).\nRead and pass texts.\n\nCounterplans\n\n\nI think counterplans are super strategic and am receptive to hearing most unconventional CPs (PICs, conditional, advantage, actor, delay, etc.) so long as you're prepared to answer theory.\n\n\nSpeaks\n\n\nSpeaker points are awarded on strategy, warranting, and weighing. I do have a knack for flowery language and compelling one-liners but as a general rule: substance &gt; style.\n\n\nThe path to a 30 probably includes really clean extensions and explanation of warrants, collapsing, weighing, etc!\n\n\n\nMy current speaks average across both Parli &amp; PF is a 28.8 [H/L = 30/27]\n\nKritiks\n\n\nKritiks are a form of criticism about the topic that typically circumvents the normative policymaking that is expected. These types of arguments usually reject the resolution due to the way that it links into topics such as ableism, capitalism, etc. Pretty receptive to these!\n\n\nRead good framework, don’t double turn yourself, have a solvent alternative.\n\n\nWhen answering the K, and especially if you weren’t expecting it, realize that there is still a lot of offense that can be leveraged in your favor. Never think that a K is an automatic ballot so do the pre- v. post fiat analysis for me, tell me why policymaking is a good thing, and call out their shady alternative.\n\n\nI think that teams that want to run these types of arguments should exhibit a form of true understanding and scholarship in the form of accessible explanations if you want me to evaluate these arguments fairly.\n\n\nTheory\n\n\nI'm a lot more willing to evaluate theory, or arguments that set norms that we use in debate.\n\n\nI default to competing interps over reasonability, meaning that both teams should probably have an interp if you want to win theory. Feel free to change my mind on this and of course, still read warrants as to why I should prefer one over the other.\n\nI'm slowly beginning to care less if theory is frivolous as my judging career progresses but at the same time try not to choose to be exclusionary if you're aware of the technical ability of your opponents. Inclusivity and access are important in this activity.\n\nPoints of Information/Order\n\n\nPLEASE take at least two POIs. I don't really care how many off case positions you're running or how much \"you have to get through\" but you can't put it off until the end of your speech, sit down, and then get mad at your opponents for misunderstanding your arguments if you never clarified what it was in the first place. On the flip side, I won't flow POIs, so it's up to you to use them strategically.\n\n\nTag teaming is fine; what this looks like is up to you.\n\nCall the P.O.O.—I won't protect the flow.\n\nUltimately, I don't want anyone to ever feel uncomfortable after a debate round so feel free to post round with me as much as you want (if time permits, although I won't change my vote after a round) because I am here to educate and help others in the activity that has given me everything :)\n\n",
        "rating": "Tech"
    },
    {
        "name": "Tyler  Tsudama",
        "school": "Hire",
        "paradigm": "8 rounds\n\n\n\n\n\n\n\n\n\n\n\nLast changed on\nFri September 17, 2021  at 9:48 PM EDT\n\n\nHello Everyone! Find the event you are competing below and read the paradigm!\nCongress:\nI want to see proper etiquette in round and respect to every single Senator/Representative.\nArgumentation, Creativity, and Presentation are my top 3 things I look for when I judge.\nArgumentation: Your arguments need to make sense. You need to have a clear warrant/evidence and you need to show how your evidence links to your position.\nCreativity: Be funny. Give me a funny intro or make me laugh and that's a huge bonus to your rank. Congress invitational rounds are very long and some speeches get blended together. Stand out. Puns are huge for me and originality is key. Arguments that are unique to the debate/not stock arguments, add a lot to the debate and I really appreciate it.\nPresentation: Be presentable. Act like you want to be here. Effective gestures and facial expressions add a lot to what you are talking about.\nFlow of Debate:\nIf you are speaking in the 5th or 6th cycle, try not to give constructive speeches but crystallization speeches/consolidation speeches. Giving constructive speeches late kind of ruins the flow of the debate.\nCross Exam:\nI only mark off points if there is a lack of knowledge of content or presentation that isn't adequate. (example: stuttering during CX, giving a blank face during CX, or anything in between.)\nAs a competitor, you must ask questions. It helps the flow of the debate and really allows the judges to see the cross-examination aspect of Congress. When no one asks questions, it's extremely boring and really doesn't allow the judges to see if the competitor knows their stuff.\nFor PF/Policy/Parli\nPLEASE add me to the chain @ttsudama@gmail.com (if rules allow) \n- Please don't be late.\n- Speak coherently and make sense.\n- While I have experience in debate, I want you to speak slowly and calmly. Yelling doesn't make you right. If the volume does become too loud I will mark that off speaker points. If you are speaking too fast and become incoherent I will say \"clear\" one time as a reminder that you are either going too fast or because you are incoherent. After that, there are no more warnings and you have a higher chance of losing the debate because most likely I will have stopped flowing.\n- I prefer case debate. I ask that there is a minimum of theory or kritiks. IF there is one ran, it must be well said and well thought out/easy to understand. Run at your own risk.\n-Think of me as a parent judge who flows. Please do not get too technical.\n- I default to the voting framework. For example, if you say your Weighing Mechanism is Net benefits, I will choose whichever side provides the most amount of net benefits. Make sure to signpost, organization is key, and bouncing everywhere on the flow gets really confusing and leads to a dock on speaker points+ missed arguments on my flow.\nIF you have any questions, email @ttsudama@gmail.com. Ask anything there is no such thing as a dumb question. Just ask honestly. Email is free.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Dhira  Vaidya",
        "school": "Dougherty Valley High School",
        "paradigm": "Last changed on\nThu January 28, 2021  at 5:53 AM PDT\n\n\nBy profession, I am a Program Manager with Bank of the West and have worked for 2 decades with several diverse teams with different opinions on matters. I enjoy considering conflicting points of view. I am a PF judge and have a reasonable familiarity with the rules.\n- Please do not use extremely complicated debate jargon.\n- I try to keep my evaluation exclusively to the flow. In-round weighing of arguments combined with strength of link and conceded arguments. I default to arguments with substantive warranted analysis.\n-I strongly encourage debaters to cut cards as opposed to hyperlinking a google doc.\n- Please collapse\n- Defense should be extended in both summary speeches if you want to go for it in the final focus\n- Speaker points are used to indicate how good I think debaters are in a particular round\n- Be respectful in cross as I play close attention to it.\n- Don't speak too fast but if you do please give me the speech doc\n- Time yourself and make your opponents accountable for their speech and prep timings\n- Weigh your impacts and explain\n- Provide an off-time roadmap\n- Have Fun!\nPlease let me know if you have any questions. My email is dhira.vaidya@gmail.com\n\n",
        "rating": "Lay"
    },
    {
        "name": "Mason  Vega",
        "school": "ModernBrain",
        "paradigm": "Last changed on\nFri September 17, 2021  at 11:41 AM PDT\n\n\nI mainly have a preference for speaking speed. I prefer speeches to be within the realm of a reasonable conversational speed.\nI am an intermediate-level judge. I have judged PF a handful of times. I understand the content well but am unfamiliar with some debate jargon. I respond well to logical arguments and appreciate respect between competitors. \n\n",
        "rating": "Tech"
    },
    {
        "name": "Anusha  Venkatesan",
        "school": "Centennial HS",
        "paradigm": "Last changed on\nWed September 15, 2021  at 2:20 PM CDT\n\n\nI'm a lay judge. Please be kind to each other , speak clearly and slowly, and no yelling. Read good quality evidence from credible sources. \n\n+1 speaker points if you send your cases with the evidence cards\nadd me to the email chain- anusha_venk2002@yahoo.com\n\n",
        "rating": "Lay"
    },
    {
        "name": "Vishnu  Vennelakanti",
        "school": "Hire",
        "paradigm": "8 rounds\n\n\n\n\n\n\n\n\n\n\n\nLast changed on\nSun September 26, 2021  at 6:23 AM PDT\n\n\nI debated PF and LD for two years on the national circuit for Mountain House High School. I would say I was decent. I coached for Mountain House Parli for a year and coached a top 10 Parli team.\nContact me on Messenger @ Vishnu Vennelakanti and add me on the email chain @ vvennela@ucdavis.edu\nI now study computer science and economics at UC Davis (co 22)\nIn general you should make the round easier for me to judge. Cleaner flows usually mean better debaters.\nYou should also be weighing, weigh early and weigh well.\ncard &gt;&gt;&gt; rhetoric, tech &gt;&gt;&gt; truth.\nPrefs:\nSubstance is most preferable but it's also ordered in terms of experience.\nSubstance: 1 ( my most preferable)\nKs: 1-2 ( i can handle most Ks well, but please explain it regardless)\nTheory: 3 ( not a fan of theory, only run if there was clear abuse in the round )\nPhil: 2\nRVIs: 2\nTrix: 5 ( do not run Trix please )\nAff Ks: 4\nperformance: 4-5\nSome specifics:\nKs: link into the aff case and have a specific alt. \"do the neg\" alts are suboptimal at best. if you're going against a k, i'm fine with extinction outweighs type offense. i don't like k affs. please stay topical.you cannot have a k in pf. i do not see \"ending the world\" as inherently bad.\nplans: clever, well-rounded and nuanced plans are welcome. don't be afraid to run something unique. perms are fine. solvency advocates are good, use them.\ncps: if aff goes for a plan, you should definitely go for a counterplan(or k). i'm fine with pics, you will need to convince me. explain why the CP is comp and weigh. you should have disads and advantages, your advantages should be specifically only for your cp.\ntheory: please for the love of god, do NOT argue about bare plurals or whatever theory is \"in\" for that topic. It's boring and VERY annoying to watch a thirty minute debate which is contingent on \"is democracy a bare plural?\" Run ONLY if there is real abuse and run ONLY if dropping the debater will ACTUALLY dissuade further abuse.\nin general:\nsend me speech docs if you're LD and PF. talk at any rate you want, but make sure to ask your opponent if they're comfortable with spread. a lot of \"good\" varsity debaters try their hand at circuit LD/pf and the spread dissuades them from participating from the event. aff sets the pace, so if aff doesn't spread, do not spread. keep it conversational. \ntry not to spread in parli, it's generally not feasible.\nspeaking scale ( taken from yale because i'm incredibly lazy ):\n29.5 to 30.0 - WOW; You should win this tournament\n29.1 to 29.4 - NICE!; You should be in Late Elims\n28.8 to 29.0 - GOOD!; You should be in Elim Rounds\n28.3 to 28.7 - OK!; You could or couldn't break\n27.8 to 28.2 - MEH; You are struggling a little\n27.3 to 27.7 - OUCH; You are struggling a lot\n27.0 to 27.2 - UM; You have a lot of learning to do\n26.0 to 26.9 - OH MY; You did something very bad or very wrong\n\n",
        "rating": "Tech"
    },
    {
        "name": "Suzanne  Vitela",
        "school": "Fullerton Union High School",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Chris  Waldheim",
        "school": "Flintridge Preparatory",
        "paradigm": "None\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Corin Jeanne Wallace",
        "school": "Hire",
        "paradigm": "8 rounds\n\n\n\n\n\n\n\n\n\n\n\nLast changed on\nThu November 12, 2020  at 8:35 AM CDT\n\n\nMy background:\nI have a background in speech and forensics, having done policy debate (CX), oratory, congress, etc. and other speech and debate activities throughout high school and college. I'm a KUDI alumna and my graduate work is in policy analysis and rhetorical discussion of same by young people. I love debate and I want you to learn something and yes, have fun. This should be enjoyable, and you are learning critical thinking skills by doing this.\nMy public speaking approach:\nI do not expect public speaking perfection. If you are working on your public speaking skills, you can absolutely tip the scales with your argumentation and intellect. This is a technique that you should be practicing more than a spread/speed flow. I don't mind a spread - and practiced spread debate myself - but remember -- if you can't back up that approach with a lot of intellectual discipline, it will fail. I will see right through it.\nI don't care what you wear, how you sit, if you stand. I want to see \"a mind at work.\"\nYou can send me your case. My email is coringilbert@gmail.com Why would you do this? Because you just want to save time. Because you've crafted a case that will dominate the discussion and you are focused on stock issues and wish to empower me to dig in to prep.\nGeneral Paradigm \nAnything is valid if you signpost, signal and stick to your framework. Don't try to do too much. I appreciate attention to the stock issues, but I appreciate the evolving nature of this activity and if you choose to adjust to T/R, gaming model, or offer a kritik -- do so with confidence and walk the judge(s) fully through the model you are using. Strive to make sense. Work to be crystal clear, as the round moves on, what elements are being dropped by the other side.\nTheory: I'm open to them, but you had better bring the thunder in terms of providing clear rationales for each element of the theory. DO NOT ASSUME that your theory will be acceptable. Theoretical debate frames have to float and if you present one, it's got to be focused on a traditional debate outcome. Your judges (myself included) expect to be able to explain clearly a rationale for a decision on the ballot. Read the room. If your theory is ineffective -- don't be afraid to punt.\nIf I hear an argument that is racist, homophobic, Islamophobic or Anti-Semetic -- you will lose. Similarly, I have no issue with passion, healthy intellectual aggression, and even a little passive-aggressive gamesmanship. But candor should never be confused with condescension.\nI love a clean flow at the end of the day. Give me a reason to cross out arguments that have been covered, circle things left untouched and structure a ballot with insight on how you might improve.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Sanjay  Wattal",
        "school": "The Quarry Lane School",
        "paradigm": "Last changed on\nTue September 1, 2020  at 2:20 PM PDT\n\n\nSecond year lay judge.\n1. Do not speak too fast. Be Clear.\n2. Rather than just reading cards, make sure to clearly warrant everything you say in round.\n3. Make sure your arguments are consistent throughout the round.\n4. Any arguments made in final focus must have been mentioned in summary.\n5. Be sure to weigh clearly. Interactive weighing is great.\n6. Do not be rude to your opponents during the round.\n\n",
        "rating": "Lay"
    },
    {
        "name": "Luke  Wong",
        "school": "Fremont High School",
        "paradigm": "Last changed on\nSat September 18, 2021  at 6:14 AM PDT\n\n\nFlay Judge.\nDid public forum for about 3 years\nLike to judge more lay but will understand terms\nI like to see weighing done earlier but don't like weighing that doesn't add any value\nI don't like theory arguments\nbe respectful\nDon't really listen to grand cross so if both teams agree, we can just skip it and take prep insteadHave a good understanding of septober topic so I will understand most of the arguments\n\n",
        "rating": "Lay"
    },
    {
        "name": "Tom  Woodhead",
        "school": "Saint Francis High School",
        "paradigm": "Last changed on\nThu September 19, 2019  at 7:14 AM PDT\n\n\nVery experienced judge and coach for Saint Francis high school. I will consider pretty much any arguments that are not blatantly sexist, racist or crudely discriminatory (blatant is the key word here, much of this stuff is debatable and I will try not to punish you for my general feelings about your arguments).\nIt is important to me that debaters be respectful and polite to each other, this puts the spotlight on the arguments themselves and I am not a fan of extra drama.\nI try hard to be fair and the following things help me do that:\n- I rarely call cards. I like to focus the debate on the analysis given by the debaters (of course I will usually give more weight to analysis that is taken from qualified sources). I do not like to decide debates on random parts of a card that neither debater really focused on. I will call cards if I forget what they said, if there is a conflict about what they say and I can not remember, or if I am personally interested in the card.\n- I try to judge on the flow in the sense that I evaluate the debate on the arguments presented, explained and extended into the rebuttals. I will occasionally do the work to weigh impacts or decide framing if the debaters are not doing that for me.\n- I will not yell \"clear\", so mumble and slur at your own risk (I don't yell clear because I don't want a team to find that sweet spot where I can understand them but their opponents can not). I will also not evaluate arguments that I can not hear. I do not read speech documents during the debate rounds, sometimes I will look at them after the round (see calling cards stuff above).\nArgument preferences:\nI am cool with critiques on the aff and neg.\nI am cool with framework (I like the debaters to work this out and I am pretty neutral on this question).\nI like clarity (both in speech and arguments). I am not impressed by things that are \"too complex\" for me to understand but I will do my best to try to make sense of it. I am confident enough to not pretend I know your position and I will not fill in the blanks for you.\nI am cool with policy arguments.\nI have a wide breadth of knowledge but little depth on certain positions, don't assume I know your literature.\nSpeaks:\nI give high speaks for clarity, efficiency, a pace that I can flow, respectfulness and occasionally speaking style.\nI feel like the speaker point range I give is pretty close to average (I am not a reliable source of high speaks for everyone, but I will reward excellent debate with high speaks).\nContact info\nmail all speech documents to: headofthewood@gmail.com\nanything else (if you want me to read the e-mail or respond): thomaswoodhead@sfhs.com\n\n",
        "rating": "Tech"
    },
    {
        "name": "Qiang  Xie",
        "school": "Leland High School",
        "paradigm": "Last changed on\nSat November 14, 2020  at 12:20 PM PDT\n\n\nI'm a parent judge. This is my second year judging.\nPlease don't go too fast. I have lived in the US for almost 30 years now and am very familiar and interested in all kinds of political topics.\nI will try my best to take some notes, so please signpost.\nThanks! Good luck!\n\n",
        "rating": "Lay"
    },
    {
        "name": "Patricia  Yango",
        "school": "Hire",
        "paradigm": "Last changed on\nMon October 4, 2021  at 5:59 AM MST\n\n\nPronouns: She/Her\nEmail: patriciayango@email.arizona.edu\nI am a 2020 graduate of Perry High School (AZ) and a 4 year competitor in a variety of speech and debate events at both the local and national levels. I am currently coaching at Tempe Preparatory Academy and competing for the University of Arizona. At UArizona, i'm studying Law and Public Policy with minors in Urban Development and art history. I'm the Arizona District Assistant Coach of the Year (2021).\nin the wise words of Hannah Littler: \"I consider over-generalizing arguments to be harmful to the debate space. Running arguments along the lines of \"X people are not suffering\" or \"no one has this problem anymore\" will hurt your results. Use your clearest judgement when using absolute statements. Your perspective and evidence can only be stretched to an extent. For many conversations in s&amp;d, we have the privilege of discussing topics we will never face; speak with that privilege in check.\"\ntldr; signpost always. run whatever you want (no trix tho pls). check your privilege.\nyou are responsible for the weighing, extensions, and impact calc (and explaining unfamiliar lit).regardless of if you debate trad or progressive, good comparative impact calc will prob win you my ballot. i am a lazy judge. in an ideal world, you are filling out my ballot for me. tell me what i need to vote on EARLY IN THE ROUND and why. if you leave that up to me, you probably wont be happy with my RFD. pretty much any argument goes as long as you have a warrant and can explain it well.\nGeneral:\nI tend to be tech&gt;truth as much as i can. my truth intervenes when privilege is not kept in check (see above) Blippy arguments stand unless you respond and i can be persuaded either way on RVIs. i will not shadow extend for you.\n speed is fine, but please put me on the chain !!! \nNo, I do not care if you're dressed up or if you \"sit or stand for x\".\nflashing is not prep (do not abuse this), but please have a doc for sharing set up when you enter the round.\nflex is fine. i'll flow.\ni will disclose r4 onwards (r6 if it is a bid tourney, and obv not finals lol) unless tournament rules prohibit it/competitors are not comfortable w it.\nI don't flow cross. I'm easily distracted, so if you want me to flow it, please bring it up in a later speech.\nI do expect you to time yourself and your opponents during speeches, cross, and prep. most of the time i will cross time you (esp for prep) but sometimes (most of the time) i forget. i therefore rid myself of any responsibility to prevent prep stealing.\nmy speaks start at a 28 and move from there. I don't go below a 26 unless you do something really really bad.\nBe respectful of yourselves, me, and especially your opponents! Everyone is here to learn, first and foremost. That cannot happen if the round is not a safe space. If I see or hear abusive behavior of any kind (this includes being unnecessarily aggressive towards novice debaters!!!), I will stop the round, drop you, and report you to tab.\nside note: if there is anything i can do to make the space more welcoming or comfortable for you, please let me know either by email, in person, whatever works!\nThis is going to sound cliché, but above all have fun and walk out of the round a better competitor than when you entered it.\nps: if u made it this far, any song references u can make from the Spice Girls or taylor swift OR olivia rodrigo will get u an auto +.1 on speaks :P\n\n",
        "rating": "Tech"
    },
    {
        "name": "Marc  Yoon",
        "school": "BC Academy",
        "paradigm": "Last changed on\nFri September 11, 2020  at 5:57 AM PDT\n\n\nI'm currently a university student studying Political Science at University of California - Berkeley. I started doing Public Forum in 7th grade, so I have around 6 years of experience in debate.\nWhat I'm looking for in debate rounds:\nI will definitely flow all your arguments, and the arguments I have written down on my flow will be the most important factor when I'm deciding who won the round. But more specifically, I am looking for clear, quantifiable impacts that I can consider when weighing.\nIf you drop an argument during your summary/final focus, I will not incorporate that into my voting issues. It is your responsibility to extend through all evidence and arguments to the very last speech if you want it to win you the round.\nI was also a second speaker during my time as a high school debater, so I am looking for direct clashes to arguments in the refutation speech. I want you to directly attack the links and analysis to an argument when refuting.\nIn terms of speaking style, I am okay with speed, as long as it is not spreading. If you spread, especially in an online tournament, I will not be able to understand you as it is much harder to understand through a zoom call compared to an actual in-person debate.\nOther than that, speak clearly and persuasively, but at the end of the day, if you have better arguments and evidence, speaking style comes second.\n\n",
        "rating": "Tech"
    },
    {
        "name": "Te-Chun  Yuan",
        "school": "Pu Tai Junior High",
        "paradigm": "8 rounds\n\n\n\nNone\n\n\n\n\n\n\n\n\n\n\n",
        "rating": "Lay"
    },
    {
        "name": "Wenhan  Zhu",
        "school": "Montgomery High School Independent",
        "paradigm": "Last changed on\nFri September 25, 2020  at 3:58 PM EDT\n\n\nHi. My name is Wenhan Zhu. This is my first time being a judge. I have very little debate experience but have been a member of a Toastmasters public speaking club. I would prefer if the speakers speak slowly so I can hear the arguments more clearly.  \n\n",
        "rating": "Lay"
    }
]